{"Id": 1, "PostId": 6, "Text": "I agree, but I expect we'll get a lot of this do we have a way of easily communicating simple things like diameter vs. actual cartridge name? I guess what I'm getting at is that I see a potential real question in there  and I'm wonder how we can salvage it if a newbie comes along. That proto-question is: \"All other things being equal is 45ACP or 40S&W more accurate?\"", "CreationDate": "2011-11-01T20:00:21.057", "UserId": 37}
{"Id": 2, "PostId": 2, "Text": "When you discuss a question from the main site on meta, toss a link to it in the comments on the main question so people viewing that know to look here! (:", "CreationDate": "2011-11-01T20:00:33.660", "UserId": 4}
{"Id": 3, "PostId": 5, "Text": "Thanks for opening this. I intentionally asked that question to get this sorted out. To be specific, I wanted to ask a legal question that wasn't clearly about illegal or dangerous behavior, and the scope of question covered an entire country rather than a state or city.", "CreationDate": "2011-11-01T20:02:55.640", "UserId": 37}
{"Id": 4, "PostId": 6, "Text": "That would be a more reasonable question, but it would still be a pretty silly one.", "CreationDate": "2011-11-01T20:03:09.990", "UserId": 22}
{"Id": 5, "PostId": 6, "Score": 1, "Text": "Silly how? I can easily imagine a relative newbie thinking 9mm is more accurate than 10mm or 40SW is more accurate than 45ACP. The right answers might be along the lines of the \"individual cartridge doesn't determine accuracy. It is possible to have identical accuracy with either cartridge. In pistol cartridges, the biggest factors for accuracy are...\"", "CreationDate": "2011-11-01T20:06:00.893", "UserId": 37}
{"Id": 6, "PostId": 6, "Text": "It is silly to be worried about accuracy of general calibers in handguns. The firearm and the shooter will have way more effect on the accuracy of a pistol. Bullet design for accuracy becomes an issue in shooting > 200yds with a rifle. 25-75 ft with a pistol, use what you are comfortable with and what gives you good results. Anything else is navel gazing.", "CreationDate": "2011-11-01T20:12:11.930", "UserId": 22}
{"Id": 7, "PostId": 7, "Text": "I agree with the commenter (on the original question) who requested the question be reworded to be more focused on the bullet hole size. Drop the first paragraph, maybe?", "CreationDate": "2011-11-01T20:27:00.787", "UserId": 44}
{"Id": 8, "PostId": 11, "Text": "+1. We should allow movie questions but there has to be a real question (like the 9mm bullet hole portion). How about: \"Do bullets really spark?\"", "CreationDate": "2011-11-01T20:29:37.853", "UserId": 37}
{"Id": 9, "PostId": 11, "Score": 1, "Text": "I think \"Do bullets really spark?\" is too vague to be answered. How about \"Do bullets really spark when they hit pavement/concrete/metal/whatever?\"", "CreationDate": "2011-11-01T20:31:10.657", "UserId": 78}
{"Id": 10, "PostId": 11, "Text": "you're right. I didn't think it through as carefully as I would when writing an actual question.", "CreationDate": "2011-11-01T20:32:04.933", "UserId": 37}
{"Id": 11, "PostId": 11, "Text": "Sure, and to be clear, I'm not trying to be needlessly critical, though my terse style is often interpreted that way.", "CreationDate": "2011-11-01T20:34:24.320", "UserId": 78}
{"Id": 12, "PostId": 4, "Text": "Isn't the \"vote up you agree with\" bit inherent to the engine?", "CreationDate": "2011-11-01T20:41:16.433", "UserId": 59}
{"Id": 13, "PostId": 4, "Text": "It is. It's more the \"vote down answers you don't agree with\" part I meant to call out. A down vote usually means: \"bad answer\", on meta, it means: \"I'm voting against this answer to the discussion\".", "CreationDate": "2011-11-01T20:48:36.767", "UserId": 37}
{"Id": 14, "PostId": 6, "Score": 1, "Text": "I guess this is where we disagree on the point of the site. I think a single answer that talked about the technical differences (i.e. is there data showing 45ACP is more accurate in a controlled environment) as well as explaining that in handguns so many other factors outweigh this technical difference would be a useful addition. StackExchnage sites are often filled with a good combination of deep esoteric knowledge as well as practical advice.", "CreationDate": "2011-11-01T20:57:42.840", "UserId": 37}
{"Id": 15, "PostId": 6, "Text": "But it is a false premise. It is impossible to gauge the accuracy of a particular cartridge without knowing the type of firearm it will be fired from.", "CreationDate": "2011-11-01T20:59:58.143", "UserId": 22}
{"Id": 16, "PostId": 3, "Score": 2, "Text": "The more inclusive we are the better the site will fare ...", "CreationDate": "2011-11-01T21:44:28.723", "UserId": 10}
{"Id": 17, "PostId": 3, "Text": "@Zypher: That's not always true. There is a good reason that StackOverflow and Serverfault are different sites, even though many coders often have ServerFault-y questions come up during their day jobs. Specifically for the Firearms site, I can imagine a ton of Airsoft or Paintball questions that would not keep the interest of many firearms enthusiasts and experts. If we can't keep a coherent group of experts, we have no site.", "CreationDate": "2011-11-01T21:57:05.420", "UserId": 37}
{"Id": 18, "PostId": 3, "Text": "think of it as Programming vs Server Administration. They are both large fields that include a lot of things that attract many experts that don't necessarily want to be seen by everyone on the site. Also I've yet to meet a Firearms expert/enthusiast that isn't interested in paintball/airsoft .. but that's a small sample size", "CreationDate": "2011-11-01T22:09:11.487", "UserId": 10}
{"Id": 19, "PostId": 14, "Score": 2, "Text": "I love the 'tags' tag on this question.", "CreationDate": "2011-11-01T22:22:26.353", "UserId": 22}
{"Id": 20, "PostId": 3, "Text": "That definition also excludes airguns which are used in relatively conventional hunting and target shooting scenarios. They're used (and in many jurisdictions legally treated) as firearms even though there's no propellent involved.", "CreationDate": "2011-11-01T22:24:49.640", "UserId": 103}
{"Id": 21, "PostId": 14, "Score": 2, "Text": "Yeah I tried to put tag in but you can't create new tag on the mobile site. I was laughing while I submitted that.", "CreationDate": "2011-11-01T22:29:52.803", "UserId": 78}
{"Id": 22, "PostId": 3, "Score": 2, "Text": "If you all have a different definition, propose it as an answer. That's the point of this meta question.", "CreationDate": "2011-11-01T22:41:12.133", "UserId": 37}
{"Id": 23, "PostId": 17, "Score": 2, "Text": "+1 to the \"unwary can get snagged in\". Legally transporting a handgun in California is a common question on gun forums and is typically full of a bunch of opinion and very little fact. However, that exact question sort of blows a hole in my argument about my original question being ok because the scope was federal. Hmmm.", "CreationDate": "2011-11-01T23:02:58.440", "UserId": 37}
{"Id": 24, "PostId": 18, "Text": "Are you suggesting that _all_ hyphenated tags should be verboten or just those that are \"firearm-{something}\"?", "CreationDate": "2011-11-01T23:23:14.450", "UserId": 26}
{"Id": 25, "PostId": 18, "Text": "This is too broad a generalization to offer any blanket policies. It might be better to address specific tags you see as incorrect.", "CreationDate": "2011-11-01T23:52:45.010", "UserId": 95}
{"Id": 26, "PostId": 18, "Score": 1, "Text": "I see \"firearms-{something}\" as unnecessary. It is my understanding that all the tags used within the firearms section are \"unique\" within this sub-forum, so a tag like \"firearms-safety\" is not as useful as one that is simply \"safety\".", "CreationDate": "2011-11-01T23:58:16.923", "UserId": 78}
{"Id": 27, "PostId": 2, "Text": "I saw the title of this question and expected something relating to optics. :)", "CreationDate": "2011-11-02T01:14:46.527", "UserId": 79}
{"Id": 28, "PostId": 20, "Text": "I'm guessing that trying to retag questions about safe gun handling is going to be a losing battle. I'm wondering if it might make sense to go the other way and have a tag like \"safety-mechanism\".", "CreationDate": "2011-11-02T01:56:37.037", "UserId": 26}
{"Id": 29, "PostId": 20, "Text": "You could *try* specifying what the tag is for in the tag wiki associated with it. Probably won't prevent all mistakes, but at least it'd be there for conscientious users who see both [safety] and [gun-safety] and care to pick the right one.", "CreationDate": "2011-11-02T02:02:56.873", "UserId": 48}
{"Id": 30, "PostId": 21, "Text": "That's a good point about \"safety\". That is a tag that could be very ambiguous, whether it's firearm-safety or safety alone.", "CreationDate": "2011-11-02T03:14:14.390", "UserId": 78}
{"Id": 31, "PostId": 18, "Text": "Specific tags I have seen that seem unnecessarily hyphenated include \"firearm-myths\" and \"firearm-misconceptions\". Why not just \"myth\" and \"misconception\"", "CreationDate": "2011-11-02T03:14:46.480", "UserId": 78}
{"Id": 32, "PostId": 24, "Text": "Optics really isn't appropriate for questions about iron sights (which is what 3 of the 4 questions tagged \"sights\" are primarily about).", "CreationDate": "2011-11-02T03:17:10.650", "UserId": 79}
{"Id": 33, "PostId": 24, "Text": "But it's completely appropriate for the post on holographic sights.", "CreationDate": "2011-11-02T03:19:24.010", "UserId": 78}
{"Id": 34, "PostId": 8, "Text": "I'd love to hear the reason for the down votes on this one.", "CreationDate": "2011-11-02T03:25:40.103", "UserId": 78}
{"Id": 35, "PostId": 13, "Text": "Regardless of how rarely some laws change, they do change. Whose responsibility is it to come back and fix all the answers that are now incorrect as a result?", "CreationDate": "2011-11-02T03:26:43.503", "UserId": 78}
{"Id": 36, "PostId": 24, "Text": "True, but I think optics and sights need to be two separate tags.  Maybe a tag for iron sights too.", "CreationDate": "2011-11-02T03:40:00.310", "UserId": 79}
{"Id": 37, "PostId": 24, "Text": "See my edits to my answer.", "CreationDate": "2011-11-02T03:43:11.563", "UserId": 78}
{"Id": 38, "PostId": 26, "Text": "It is good form to supply commentary when down-voting.", "CreationDate": "2011-11-02T03:53:15.153", "UserId": 78}
{"Id": 39, "PostId": 13, "Text": "That's the benefit of the SE system: all answers can be edited. If someone who is aware that a given law has changed happen upon an old, outdated one, they can update it, or provide their own.", "CreationDate": "2011-11-02T04:06:36.103", "UserId": 125}
{"Id": 40, "PostId": 17, "Score": 2, "Text": "Answers full of opinion and lacking fact often are exposed as such and either down-voted or ignored, and ones with truth and facts (and often reference links) are the ones that are typically voted up. The system compensates for this.", "CreationDate": "2011-11-02T04:08:26.497", "UserId": 125}
{"Id": 41, "PostId": 26, "Text": "\"...too often in flux for a static answer to remain relevant and correct.\" Such is the case with most information on the web, and the primary purpose of the Stack Exchange platform is to combat old information being presented as fact (such as what happens through search engines). Anyone can edit and answer, and most can comment, so in the event an answer becomes no longer relevant, such can be noted, whether by down-votes (and a comment), another answer, or an edit.", "CreationDate": "2011-11-02T04:12:30.947", "UserId": 125}
{"Id": 42, "PostId": 24, "Text": "Sounds good to me.", "CreationDate": "2011-11-02T04:15:55.240", "UserId": 79}
{"Id": 43, "PostId": 8, "Text": "As with anything, it's up to the consumer of information to determine the validity of said information by validating it on their own. If they want to trust the Internet over a lawyer then such is their prerogative (and their risk). That's no reason not to allow the dissemination of useful information, however, especially the law when it comes to firearms. As someone else mentioned here, the two go very much hand-in-hand.", "CreationDate": "2011-11-02T04:16:59.480", "UserId": 125}
{"Id": 44, "PostId": 22, "Text": "Each post has a timestamp already (answered x hours/days/months ago). Plus, most decent answers have external links referencing source material (government web site, etc.). Further, each answer can be edited by the community; if an answer becomes outdated, someone can change it to reflect as much (or comment, allowing the author to change it).", "CreationDate": "2011-11-02T04:18:31.023", "UserId": 125}
{"Id": 45, "PostId": 27, "Text": "I guess part of my question with regards to the answer I linked to above was that the question was not location-specific and the answer assumed USA. Is there any way we can encourage people to include a location in their question where the answer is likely to be location-dependent?", "CreationDate": "2011-11-02T09:05:57.257", "UserId": 103}
{"Id": 46, "PostId": 22, "Text": "Touche, good sir.", "CreationDate": "2011-11-02T12:49:15.637", "UserId": 65}
{"Id": 47, "PostId": 5, "Text": "Here's an other legal question, specific to California:\nhttp://firearms.stackexchange.com/questions/158/can-i-legally-remove-capacity-limiting-devices-from-a-shotgun-in-california", "CreationDate": "2011-11-02T13:34:47.723", "UserId": 37}
{"Id": 48, "PostId": 25, "Text": "An example of a location specific question asked well: http://firearms.stackexchange.com/questions/158/can-i-legally-remove-capacity-limiting-devices-from-a-shotgun-in-california", "CreationDate": "2011-11-02T13:35:15.663", "UserId": 37}
{"Id": 49, "PostId": 26, "Text": "@dgm: Down-votes on meta simply indicate the voter does not agree with this point of view. Additional explanation is often not given or needed.", "CreationDate": "2011-11-02T15:07:12.287", "UserId": 63}
{"Id": 50, "PostId": 8, "Text": "@dgm: Down-votes on meta simply indicate the voter does not agree with this point of view. Additional explanation is often not given or needed.", "CreationDate": "2011-11-02T15:07:27.700", "UserId": 63}
{"Id": 51, "PostId": 29, "Text": "I think an example would be \"shotguns\".  A glance down the front page tells me that there are singular tags for \"rifle\" and \"pistol\".", "CreationDate": "2011-11-02T17:18:26.790", "UserId": 85}
{"Id": 52, "PostId": 29, "Text": "...Just make them synonyms?", "CreationDate": "2011-11-02T17:24:12.960", "UserId": 124}
{"Id": 53, "PostId": 32, "Text": "Thanks! No need for the synonym since [tag:safety] will be removed shortly.", "CreationDate": "2011-11-02T17:54:56.183", "UserId": 24}
{"Id": 54, "PostId": 33, "Text": "I don't see a \"improve this question\" link on the site.", "CreationDate": "2011-11-02T18:32:36.883", "UserId": 37}
{"Id": 55, "PostId": 33, "Score": 2, "Text": "@kbyrd: Below each question, right underneath the tags, there's a link that says \"improve this question\". If you have enough reputation to edit, the link will say, simply, 'edit'.", "CreationDate": "2011-11-02T19:29:08.367", "UserId": 95}
{"Id": 56, "PostId": 33, "Text": "Ahh, that's the issue. I see \"edit\".", "CreationDate": "2011-11-02T19:35:29.577", "UserId": 37}
{"Id": 57, "PostId": 17, "Text": "Navigating firearm laws is such a big part of being a gun owner that I'd see it as a mistake to exclude good questions about laws at the different jurisdiction levels. I'm perfectly fine with \"Is it legal or illegal\" or \"how do I do this legally\" type questions. If answers stray from citable law or spread FUD then they'll get voted down.", "CreationDate": "2011-11-02T19:52:30.323", "UserId": 17}
{"Id": 58, "PostId": 13, "Text": "Unless you are an attorney, you shouldn't be giving legal advice. Seems simple enough to me.", "CreationDate": "2011-11-02T20:13:14.957"}
{"Id": 59, "PostId": 17, "Score": 1, "Text": "The only problem that I see Andrew, is that consensus doesn't always mean accuracy. But I do think that you have hit on a standard to be held. If legal opinions are being given, citation of law should be included in answers and those without removed.", "CreationDate": "2011-11-02T20:15:41.663"}
{"Id": 60, "PostId": 12, "Text": "I'd upvote your answer but I think you left something out. If the pattern of answers is to cite law, then I would agree with with your premise. But even that could be considered to be practicing law without a license and there could easily be liabilities incurred.", "CreationDate": "2011-11-02T20:19:04.343"}
{"Id": 61, "PostId": 5, "Score": 1, "Text": "And I think that question should also be closed as well, if we are going to be consistent and careful.", "CreationDate": "2011-11-02T20:21:05.290"}
{"Id": 62, "PostId": 24, "Score": 1, "Text": "But my question is that the current tag is \"sight\" and not \"sights\". I do think that using the general tag \"sights\" is better as each of what you are proposing are specific examples of \"sights\" and would require different search phrases.", "CreationDate": "2011-11-02T20:42:04.283"}
{"Id": 63, "PostId": 24, "Text": "Chris, there is no tag that is \"sights\" at this point. That is what I was asking to clarify. Because \"sights\" is a plural of \"sight\" you cannot add the \"sights\" tag (I've tried).", "CreationDate": "2011-11-02T20:45:38.943"}
{"Id": 64, "PostId": 29, "Text": "We're early enough in the formation of this group that we should nip tagging issues in the bud now. Has everyone read the \"7 essential meta questions\" link?", "CreationDate": "2011-11-02T20:53:31.950", "UserId": 78}
{"Id": 69, "PostId": 24, "Text": "That is what I was originally asking. Is there a way to directly ask a moderator to do this?", "CreationDate": "2011-11-03T04:35:40.837"}
{"Id": 70, "PostId": 47, "Text": "Could you provide some examples of questions that you do consider private-beta worthy for comparison?", "CreationDate": "2011-11-03T04:55:15.277", "UserId": 79}
{"Id": 71, "PostId": 47, "Text": "What should we do with the beginner questions in the meantime? Close them? Vote them down? I'm not disagreeing with you, I'm genuinely asking.", "CreationDate": "2011-11-03T15:28:31.413", "UserId": 37}
{"Id": 72, "PostId": 46, "Text": "Not to mention even shooting a blank can be fatal if you're close enough", "CreationDate": "2011-11-03T19:09:04.067", "UserId": 99}
{"Id": 73, "PostId": 47, "Text": "@kbyrd As long as they're legitimate and otherwise appropriate questions, they have no reason to be removed or downvoted - they'd just get asked again in the future anyway. This is more a call to shift our population of content in the other direction now.", "CreationDate": "2011-11-03T19:20:26.970", "UserId": 59}
{"Id": 74, "PostId": 48, "Text": "You don't want a Navy SEAL to ask as I expect very little of what he does applies to your life with firearms. You might want a 20-year gunsmith, a shop owner, or avid collector of revolvers whose collection puts a museum to shame.", "CreationDate": "2011-11-03T19:27:11.957", "UserId": 37}
{"Id": 75, "PostId": 47, "Text": "Ok, so I asked a question about detail stripping a revolver. It's a real question, I've got that revolver, it's my only wheel-gun, and taking it apart scares me, but I do have the impression I should do it at least once. I thought it was non-beginner because I don't think many people understand the inner workings of revolvers and I was hoping someone who had actually worked on many many similar guns would answer the question. Is that question on track or is it still to beginner?", "CreationDate": "2011-11-03T19:29:11.907", "UserId": 37}
{"Id": 76, "PostId": 48, "Text": "@kbyrd fair point, but I think you got my point ;-)", "CreationDate": "2011-11-03T19:30:06.473", "UserId": 99}
{"Id": 77, "PostId": 48, "Text": "Of course, I'm just in a nit-picky mood.", "CreationDate": "2011-11-03T19:41:03.390", "UserId": 37}
{"Id": 78, "PostId": 47, "Text": "@kbyrd I don't think that's too beginner -- though it's probably on the beginner-ish end of what is private beta material.  The standard I'd like to see is \"Can a quick Google search, or a person who's been to the range 1-3 times with qualified instruction answer this question?\" If so, it's not private beta worthy.  If not, then as long as our *average* question is still \"wait, I need to call an experienced smith/instructor/etc\" level, the between questions should have no ill effect.", "CreationDate": "2011-11-03T20:03:33.847", "UserId": 47}
{"Id": 79, "PostId": 47, "Text": "@HedgeMage: \"Can a quick Google search, or a person who's been to the range 1-3 times with qualified instruction answer this question?\" That's a really good metric! I like it.", "CreationDate": "2011-11-03T20:48:05.180", "UserId": 37}
{"Id": 80, "PostId": 54, "Text": "This was the 2nd thing that came to mind while I was typing my answer. I discarded it because I think there is value in having a new user start typing \"reloa\" and seeing the two options in autocomplete. If we use a completely different word for \"put more cartridges in a firearm\" we're likely to have people using reloading anyway not knowing there is another term.", "CreationDate": "2011-11-07T14:53:28.133", "UserId": 37}
{"Id": 81, "PostId": 56, "Text": "There is certainly a lot of opinionated discussion around self-defense.  I don't think we want \"9mm vs. .45\" or \"point shooting vs. sighted fire\" questions, to name two of the perennial topics on gun forums.  However, JHP vs. everything else is really on the other end of the spectrum.  It has a clear answer that is almost universally agreed upon.", "CreationDate": "2011-11-07T15:41:18.673", "UserId": 79}
{"Id": 82, "PostId": 56, "Text": "A good answer to this question would discuss the different expansion properties of the bullets and why that's good or not good for self defense. I would say edit out the brand question because of opinions unless going off an extremely broad set of ballistic gel data.", "CreationDate": "2011-11-07T16:51:52.003", "UserId": 17}
{"Id": 83, "PostId": 51, "Text": "There are two types of expert questions: those that are complex/difficult, and those that are specific/obscure.  Even those without enough knowledge to manage the former can come up with the latter.  Which reminds me... I have this antique rifle I could use help identifying * *makes mental note to take pics* *", "CreationDate": "2011-11-07T17:27:41.910", "UserId": 47}
{"Id": 84, "PostId": 46, "Text": "In your experience in firearms training, would it be safe to say that \"shooting to wound\" is not an acceptable method of self defense?", "CreationDate": "2011-11-07T21:26:48.757", "UserId": 32}
{"Id": 85, "PostId": 54, "Text": "Most firearms without detachable mags have internal magazines. Unless they are single-shot they'll either be loaded via clip (Garands) or by hand (Remington 700s, SKS) to an internal box magazine.", "CreationDate": "2011-11-07T21:33:37.407", "UserId": 32}
{"Id": 86, "PostId": 58, "Score": 1, "Text": "This is a very, very good response.", "CreationDate": "2011-11-07T21:35:57.303", "UserId": 78}
{"Id": 87, "PostId": 54, "Text": "Well, that still leaves out revolvers, lever and pump action rifles, and most shotguns.", "CreationDate": "2011-11-07T23:14:03.267", "UserId": 79}
{"Id": 88, "PostId": 60, "Score": 2, "Text": "actually I would \"black list\" the reloading tag and leave it as firearm-reloading and ammunition-reloading, as to avoid people misstagging", "CreationDate": "2011-11-08T18:27:43.843", "UserId": 124}
{"Id": 89, "PostId": 60, "Text": "Definitely also a good suggestion. Either way, the simple \"reloading\" tag won't be used.", "CreationDate": "2011-11-08T19:22:25.320", "UserId": 32}
{"Id": 90, "PostId": 61, "Text": "In this case you can click on the OP's name to see is profile, which says he lives in Ohio.", "CreationDate": "2011-11-08T23:10:11.460", "UserId": 79}
{"Id": 91, "PostId": 46, "Score": 1, "Text": "Shooting to wound is definitely not recommended", "CreationDate": "2011-11-08T23:17:25.787", "UserId": 79}
{"Id": 93, "PostId": 60, "Text": "I'd like to discourage blacklisting until it's proved a problem, @DForck42 - you can use tag wikis and synonyms to drive folks in the right direction at least some of the time. Blacklisting should be used primarily for tags that don't need to exist *at all* - not for tags that should, but are ambiguous.", "CreationDate": "2011-11-09T02:58:24.713", "UserId": 48}
{"Id": 95, "PostId": 64, "Text": "Tough call, I've had to link to a store on my answer about aligning the front sight post when installing the gas block on an AR-15. In that situation, the manufacturer's website was also linked but provided no information about where the product could be purchased. Most of my other product links have been to manufacturers.", "CreationDate": "2011-11-09T03:45:12.893", "UserId": 32}
{"Id": 96, "PostId": 40, "Text": "Don't forget 7.62x63 (.30-06). Haha. I agree, the metric designation in full should be used for ambiguous calibers. But how does this deal with situations like 7.62x51 NATO vs. 7.62x51 as .308 Winchester? Or 5.56x45 NATO vs. 5.56x45 as .223 Remington? These are distinctly different rounds with different chambers required for each, yet they share the same exterior dimensions when tagged this way. Additionally, would .30-06 simply be a tag synonym for 7.62x63, or would it be the other way around?", "CreationDate": "2011-11-09T03:48:53.310", "UserId": 32}
{"Id": 97, "PostId": 66, "Text": "Then maybe somehow incite people to mention it inside the question? As for the tag pool thing, what if we prefixed the location tag with something?", "CreationDate": "2011-11-09T14:25:11.040", "UserId": 51}
{"Id": 99, "PostId": 68, "Text": "When you flag something, it get placed into a queue for moderator attention. Moderators can choose to accept your flag or dismiss it. This will affect your profiles flag weight which, if I remember right, affects sort order for flagged posts in the moderator's view of flagged posts.", "CreationDate": "2011-11-09T18:28:08.417", "UserId": 32}
{"Id": 100, "PostId": 69, "Text": "This is what I try to do.", "CreationDate": "2011-11-09T18:28:52.223", "UserId": 32}
{"Id": 101, "PostId": 74, "Score": 1, "Text": "Yeah, I think I know which user you're talking about.  I've looked at some of his edits and rollbacks and gone, 'huh'?", "CreationDate": "2011-11-09T23:33:35.537", "UserId": 79}
{"Id": 102, "PostId": 60, "Text": "Just created: firearm-reloading for: http://firearms.stackexchange.com/questions/495/does-it-damage-a-1911-to-release-the-slide-by-pressing-the-slide-release", "CreationDate": "2011-11-10T18:27:09.290", "UserId": 37}
{"Id": 103, "PostId": 79, "Text": "I would be careful of which state you're in when using that advice.  (State being a state of the United States.) Some take a very \"conservative\" view on the use of deadly force, and believe it should almost never be used regardless of the threat.", "CreationDate": "2011-11-10T18:34:46.553", "UserId": 32}
{"Id": 104, "PostId": 79, "Text": "\"I've heard (totally unconfirmed, but revealed to me by someone I consider an expert) that if you pull a weapon on someone, that person has a legal right to kill you (in the US).\"  This is certainly not true as a blanket statement.  For one thing, in most states deadly force someone cannot claim justification if they initiated a violent encounter.  For instance, if someone pulls a knife on you and you respond by pulling a gun, that person cannot claim self-defense even after you pulled the gun, because they were the one to initiate the confrontation.", "CreationDate": "2011-11-10T21:38:34.893", "UserId": 79}
{"Id": 105, "PostId": 6, "Text": "Thanks for linking to here kbyrd. As a noob, between you and GEOCHET, I feel I've learnt why it was a bad question. Sticking to the Stack format and closing it is the way to go.", "CreationDate": "2011-11-14T22:05:21.077", "UserId": 230}
{"Id": 107, "PostId": 75, "Score": 1, "Text": "Yes, unused tags will be removed daily.", "CreationDate": "2011-11-15T21:14:21.553", "UserId": 95}
{"Id": 108, "PostId": 83, "Text": "Thanks for getting back to me but I'm not sure how to proceed with the question that I asked. The question was looking for an combination of all range rules that people have encountered. I don't see how this can be turned into a simple one person answer. We'll just have to wait until the mods get to and see how they handle it.", "CreationDate": "2011-11-15T21:32:28.630", "UserId": 187}
{"Id": 109, "PostId": 83, "Text": "I've run into the same situation for my question on [concealed carry](http://firearms.stackexchange.com/questions/509/what-are-the-most-common-holster-options-for-concealed-carry). I feel like all the answers given need to be combined into a single answer, and possibly updated in the future.", "CreationDate": "2011-11-18T14:14:33.150", "UserId": 44}
{"Id": 110, "PostId": 46, "Text": "Thanks Chris. I've always wondered about \"non-lethal\" shooting. Didn't seem to be practical to me. It is good to get the perspective of an experienced trainer.", "CreationDate": "2011-11-19T02:23:58.103"}
{"Id": 111, "PostId": 3, "Text": "Spring, rubber-band, and airsoft guns are all just toys (even if they could put an eye out) so I don't think we want to include them. I don't see allowing questions about cannons or vehicle-mounted guns hurting anything (and there probably won't be many of them anyway). If we did want to exclude cannons though we may be able to use the [deflagration](http://en.wikipedia.org/wiki/Deflagration) vs detonation distinction.", "CreationDate": "2011-11-25T19:47:20.560", "UserId": 163}
{"Id": 112, "PostId": 98, "Text": "Ugh, I ended up \"migrating\" it because I voted to close with \"belongs on another site in SE\". Now I guess they'll end up having to close it as a duplicate. :-/", "CreationDate": "2011-12-08T21:41:10.113", "UserId": 78}
{"Id": 113, "PostId": 98, "Text": "Hey, look at us get our mod on.", "CreationDate": "2011-12-08T23:21:56.577", "UserId": 37}
{"Id": 114, "PostId": 98, "Text": "LOL, yeah. Look at us go...", "CreationDate": "2011-12-09T20:03:01.193", "UserId": 78}
{"Id": 115, "PostId": 99, "Text": "I just winged that one.  dgm's definition works for me.", "CreationDate": "2011-12-09T20:24:04.060", "UserId": 124}
{"Id": 116, "PostId": 100, "Text": "With bemace's caveat, I'd say the dictionary entry is fine with a citation in the main entry.", "CreationDate": "2011-12-09T21:36:54.980", "UserId": 111}
{"Id": 117, "PostId": 101, "Text": "Good point. I hadn't thought about rifles that operate on the same principle.", "CreationDate": "2011-12-13T18:23:25.887", "UserId": 78}
{"Id": 118, "PostId": 103, "Score": 1, "Text": "Isn't this just a specific version of: http://meta.firearms.stackexchange.com/questions/1/how-do-we-define-firearms?", "CreationDate": "2011-12-14T22:29:55.677", "UserId": 37}
{"Id": 119, "PostId": 107, "Text": "+1. I vote no as well. That's that's all three moderators but no one else.", "CreationDate": "2011-12-17T17:58:03.740", "UserId": 37}
{"Id": 120, "PostId": 58, "Text": "+1 from me as well. I temporarily forgot I wear a moderator hat and voted to reopen \"clip vs magazine\". Of course it immediately was reopened. I intended to apply one vote and then come here and discuss, but it's done now. Other mods: if I've overstepped, close it again.", "CreationDate": "2011-12-18T14:01:50.017", "UserId": 37}
{"Id": 121, "PostId": 72, "Text": "During discussions of reloading where the bullet is a single component, or discussions of ballistics where the bullet specifically is being talked about independent of the rest of the actual cartridge, a specific bullet tag would be useful.", "CreationDate": "2012-01-13T00:45:54.803", "UserId": 32}
{"Id": 122, "PostId": 114, "Text": "I believe this is a dup of: http://meta.firearms.stackexchange.com/questions/1/how-do-we-define-firearms\n\nIf you think it isn't, tell us why. Otherwise, this should be closed.", "CreationDate": "2012-02-27T14:15:16.490", "UserId": 37}
{"Id": 123, "PostId": 114, "Text": "@kbyrd: I agree that it's a dupe of that question. Could you please close it as a dupe so that it persists and serves as a redirect in future?", "CreationDate": "2012-02-27T14:19:33.380", "UserId": 317}
{"Id": 124, "PostId": 115, "Text": "A number of other sites (I can dig up more links, but for now here's [Ubuntu](http://meta.askubuntu.com/questions/2671/how-can-we-improve-the-greatest-hits-of-our-site)'s meta post) are orchestrating a clean-up of these questions. That could very well be an option here.", "CreationDate": "2012-03-02T04:47:30.673", "UserId": 278}
{"Id": 125, "PostId": 118, "Score": 2, "Text": "The site became more active in the last few days... maybe the post about closing it generated more interest?", "CreationDate": "2012-04-26T06:21:17.020", "UserId": 517}
{"Id": 126, "PostId": 118, "Score": 1, "Text": "there's also reddit.com/r/guns", "CreationDate": "2012-04-26T14:34:45.887", "UserId": 523}
{"Id": 127, "PostId": 118, "Score": 1, "Text": "It's a pitty :-(", "CreationDate": "2012-04-27T12:02:12.023", "UserId": 101}
