{"Id": 1, "PostHistoryTypeId": 2, "PostId": 1, "RevisionGUID": "16619519-1076-4c27-9062-71422bde3588", "CreationDate": "2011-11-01T19:30:50.997", "UserId": 39, "Text": "How do we as a site define the word 'Firearms'?\r\n\r\nWhat's on and off topic depends a lot on how we agree to define this term.\r\n\r\nRemember, on Meta, upvotes mean 'I agree' and downvotes mean 'I disagree'.\r\nThis means that if your answer is downvoted, it's not because it's a bad answer, it's just because it was disagreed with."}
{"Id": 2, "PostHistoryTypeId": 1, "PostId": 1, "RevisionGUID": "16619519-1076-4c27-9062-71422bde3588", "CreationDate": "2011-11-01T19:30:50.997", "UserId": 39, "Text": "How do we define 'Firearms'?"}
{"Id": 3, "PostHistoryTypeId": 3, "PostId": 1, "RevisionGUID": "16619519-1076-4c27-9062-71422bde3588", "CreationDate": "2011-11-01T19:30:50.997", "UserId": 39, "Text": "<discussion>"}
{"Id": 4, "PostHistoryTypeId": 2, "PostId": 2, "RevisionGUID": "13c9ba5e-de13-48d0-be33-84dfaa9fcf7b", "CreationDate": "2011-11-01T19:34:49.823", "UserId": 37, "Text": "I'm not the original poster, but I thought I would kick off meta.firearms with a discussion of : http://firearms.stackexchange.com/questions/5/what-bullet-would-give-you-more-accuracy-40-or-45\r\n\r\nI agree the question didn't contain enough information, but I'm wondering if that was intentional or the poster just didn't have enough information to use the right terms."}
{"Id": 5, "PostHistoryTypeId": 1, "PostId": 2, "RevisionGUID": "13c9ba5e-de13-48d0-be33-84dfaa9fcf7b", "CreationDate": "2011-11-01T19:34:49.823", "UserId": 37, "Text": "Scope question: http://firearms.stackexchange.com/questions/5/what-bullet-would-give-you-more-accuracy-40-or-45"}
{"Id": 6, "PostHistoryTypeId": 3, "PostId": 2, "RevisionGUID": "13c9ba5e-de13-48d0-be33-84dfaa9fcf7b", "CreationDate": "2011-11-01T19:34:49.823", "UserId": 37, "Text": "<discussion>"}
{"Id": 7, "PostHistoryTypeId": 2, "PostId": 3, "RevisionGUID": "00bb8cd0-ea65-45c0-9733-4b8c745fc2ac", "CreationDate": "2011-11-01T19:41:29.630", "UserId": 37, "Text": "At the risk of being overly broad, I'll answer with the wikipedia definition:\r\n\r\n> A firearm is a weapon that launches one, or many, projectile(s) at\r\n> high velocity through confined burning of a propellant.\r\n\r\nThis excludes spring, rubber-band, airsoft-type things. Maybe the first question is whether we want to limit talk to production firearms available to citizens or include home-made things or talk about large firearms like cannons and things mounted on various vehicles."}
{"Id": 8, "PostHistoryTypeId": 2, "PostId": 4, "RevisionGUID": "77cb8fba-b346-4765-9bf7-1e2fabf2af18", "CreationDate": "2011-11-01T19:52:49.553", "UserId": 37, "Text": "This question: http://firearms.stackexchange.com/questions/30/what-should-i-be-on-the-lookout-for-when-im-looking-at-a-used-revolver\r\n\r\nHas an answer linking to an outside source. Now, I sort of intentionally asked this question to bring up this issue (as well as because I think it's good basic question for the firearms site). There is a ton of \"settled\" information out there, like the four-rules, how to check out a used AR, how to field strip a glock (or a Ruger 10/22 argg!), etc.\r\n\r\nIt is my opinion that StackExchange sites should have answers which include information inline, not just posting a link. Obviously, there might be some copyright issues, but hopefully those will be pretty obvious.\r\n\r\nSo, what do we want? Links to existing material, or answers with text explicitly on this site?"}
{"Id": 9, "PostHistoryTypeId": 1, "PostId": 4, "RevisionGUID": "77cb8fba-b346-4765-9bf7-1e2fabf2af18", "CreationDate": "2011-11-01T19:52:49.553", "UserId": 37, "Text": "Do we want answers to be links or should uses copy/paste text?"}
{"Id": 10, "PostHistoryTypeId": 3, "PostId": 4, "RevisionGUID": "77cb8fba-b346-4765-9bf7-1e2fabf2af18", "CreationDate": "2011-11-01T19:52:49.553", "UserId": 37, "Text": "<discussion>"}
{"Id": 11, "PostHistoryTypeId": 2, "PostId": 5, "RevisionGUID": "fb059bee-7d68-48c3-9346-a70504ce391a", "CreationDate": "2011-11-01T19:55:18.143", "UserId": 63, "Text": "We currently have one example of this: [Is it legal for a non-citizen to purchase a firearm in the USA?][1]\r\n\r\nI have left commentary there, with a close vote and explanation. I will provide my opinions on this topic as an answer to this question.\r\n\r\n[1]: http://firearms.stackexchange.com/q/35/63"}
{"Id": 12, "PostHistoryTypeId": 1, "PostId": 5, "RevisionGUID": "fb059bee-7d68-48c3-9346-a70504ce391a", "CreationDate": "2011-11-01T19:55:18.143", "UserId": 63, "Text": "Should questions regarding the legality of selling/buying/possession/carrying/etc. of firearms be on-topic?"}
{"Id": 13, "PostHistoryTypeId": 3, "PostId": 5, "RevisionGUID": "fb059bee-7d68-48c3-9346-a70504ce391a", "CreationDate": "2011-11-01T19:55:18.143", "UserId": 63, "Text": "<discussion><allowed-topics>"}
{"Id": 14, "PostHistoryTypeId": 2, "PostId": 6, "RevisionGUID": "aa7ea68b-0971-4676-89b2-e1973b82b71f", "CreationDate": "2011-11-01T19:58:07.940", "UserId": 22, "Text": "The question is far too vague to answer correctly. He doesn't even list a specific type of bullet, only a diameter.\r\n"}
{"Id": 15, "PostHistoryTypeId": 2, "PostId": 7, "RevisionGUID": "a0087aa2-f352-4f35-a9ae-1cf30b88606f", "CreationDate": "2011-11-01T20:05:23.437", "UserId": 39, "Text": "In the question http://firearms.stackexchange.com/questions/54/what-type-of-shell-would-have-to-be-fired-out-of-a-shotgun-to-leave-a-small-bull I ask about the inconsistencies of weapons fire in the movie Jurassic Park.\r\n\r\nDo we want questions like this to be on topic? \r\n\r\nWith a large collection of gun experts, we could easily debunk public myths about firearms be it safety, use, cost, or any other of the many things that the general non-gun-using-public thinks they know about firearms.\r\n\r\nFirearms.SE aims to become the top authority on firearms knowledge and I personally believe having something like this be on-topic would be beneficial to us as we grow and draw traffic from search engines."}
{"Id": 16, "PostHistoryTypeId": 1, "PostId": 7, "RevisionGUID": "a0087aa2-f352-4f35-a9ae-1cf30b88606f", "CreationDate": "2011-11-01T20:05:23.437", "UserId": 39, "Text": "Movie references in relation to real firearms: On-topic?"}
{"Id": 17, "PostHistoryTypeId": 3, "PostId": 7, "RevisionGUID": "a0087aa2-f352-4f35-a9ae-1cf30b88606f", "CreationDate": "2011-11-01T20:05:23.437", "UserId": 39, "Text": "<discussion><allowed-topics>"}
{"Id": 18, "PostHistoryTypeId": 2, "PostId": 8, "RevisionGUID": "2e1ab06e-6fba-4181-b123-e0660a51218a", "CreationDate": "2011-11-01T20:07:01.747", "UserId": 63, "Text": "As noted in my commentary in the [referenced question][1], I do not think these should be permissible topics.\r\n\r\nLegality is a tricky topic. Laws are often ambiguous, and they can vary quite significantly across regions of any size, including: cities, states, and countries. Firearms laws in particular can have many minute variations. e.g. concealed carry could be OK in a church in one town but not OK in the county surrounding that town\r\n\r\nFirearms laws are also in a constant state of flux, particularly in the USA where we have significant lobbying interests trying to influence them constantly. This makes upkeep and accuracy of answers a significant maintenance headache.\r\n\r\nAdditionally, the Internet really isn't a good source of legal advice. The only _good_ and _correct_ answer to a question of legality should be, _\"Ask your lawyer.\"_.\r\n\r\nFinally, although I'm having difficulty finding specific examples, I believe topics of legality are traditionally voted off-topic on other StackExchange network sites.\r\n\r\n[1]: http://firearms.stackexchange.com/q/35/63"}
{"Id": 19, "PostHistoryTypeId": 2, "PostId": 9, "RevisionGUID": "cc8be1cf-7ac9-4ab5-a12c-200fa8a2c070", "CreationDate": "2011-11-01T20:15:56.497", "UserId": 59, "Text": "In general, unless you're forbidden from copying material, then you should be able to cite the  material in your answer. This always has the added benefit that if the link ever goes dead, the content will remain on the post. Furthermore, it is also simply a much greater convenience to future readers (who are the goal of the site to attract, after all) if they can get their answers in one place instead of having to follow links in every answer. A link-only answer should strive to instead have more information in the answer, but the link should remain as a citation.\r\n\r\nIf the entire material is too large or is otherwise unwieldy to place in an answer, then the most relevant portions should be kept in the post, possibly with additional flavor, and then the source can be linked for the entire read. Another common time to use links is to supplement an otherwise complete answer - sometimes an outside reference is very helpful to add. Regardless of the reasoning, *paraphrasing* the content of the link is also a good way to maintain the important information on our site while avoiding the issues that simply copy-paste would result it."}
{"Id": 20, "PostHistoryTypeId": 2, "PostId": 10, "RevisionGUID": "c38939b2-e0f1-4d9c-869e-b7074643f068", "CreationDate": "2011-11-01T20:16:21.347", "UserId": 63, "Text": "Great question!\r\n\r\nSpeaking as a moderator of another SE site I can shed some light on the convention for linking external resources.\r\n\r\n* It is always desirable to include more than just a link to an external site.\r\n\r\nThe most obvious benefit here is that it preserves the answer on our site, obviating the need for a user to even navigate to the external resource. If a linked resources goes dead (all too common) then an answer with just a link becomes basically useless.\r\n\r\n* Copy/paste of answers from external resources should be avoided.\r\n\r\nCopying content from another resource is wrong. We need to be respectful of the author's copyright. Only if the content is explicitly released to the public domain should we copy information verbatim. Legality aside, not respecting an author's copyright is immoral.\r\n\r\nA good answer should contain an actual answer to the question, links to resources that supplement the answer, and not be copied verbatim. If possible summarizing or paraphrasing the external resource should be done.  \r\n\r\n> If necessary small excerpts of the copyrighted work can be directly quoted as long as it is obvious that they are quotes, through the use of the block quote box."}
{"Id": 21, "PostHistoryTypeId": 2, "PostId": 11, "RevisionGUID": "aabcc5b1-4334-4a4b-ad9e-023febc1e059", "CreationDate": "2011-11-01T20:17:43.200", "UserId": 78, "Text": "I think it's a perfectly reasonable topic. I would even expand it beyond \"movies\" to include any visual medium.\r\n\r\nThere are plenty of myths, misconceptions, misrepresentations, etc. that could be debunked by an active community of knowledgeable people."}
{"Id": 22, "PostHistoryTypeId": 5, "PostId": 4, "RevisionGUID": "18f83466-73e7-45d0-b452-a15ddd2d1c6d", "CreationDate": "2011-11-01T20:17:44.483", "UserId": 37, "Comment": "added bit about vote up/down.", "Text": "This question: http://firearms.stackexchange.com/questions/30/what-should-i-be-on-the-lookout-for-when-im-looking-at-a-used-revolver\r\n\r\nHas an answer linking to an outside source. Now, I sort of intentionally asked this question to bring up this issue (as well as because I think it's good basic question for the firearms site). There is a ton of \"settled\" information out there, like the four-rules, how to check out a used AR, how to field strip a glock (or a Ruger 10/22 argg!), etc.\r\n\r\nIt is my opinion that StackExchange sites should have answers which include information inline, not just posting a link. Obviously, there might be some copyright issues, but hopefully those will be pretty obvious.\r\n\r\nSo, what do we want? Links to existing material, or answers with text explicitly on this site?\r\n\r\nVote up answers you agree with, vote down answers you don't agree with."}
{"Id": 23, "PostHistoryTypeId": 2, "PostId": 12, "RevisionGUID": "0b4d1ba0-cd5e-4a8c-942a-946e0d069851", "CreationDate": "2011-11-01T20:22:31.760", "UserId": 37, "Text": "I agree that legal questions are often problematic. However, there are some high-level legal questions that have specific correct answers and I believe would help those coming to the site for answers. I do not think we should ban all legal questions. However, I've not had to deal with this issue on an SE site, so my opinion isn't coming from specific experience.\r\n\r\nI believe my question is an example of one that should be kept. The scope is large (the US vs a city or state), and there are specific provisions around resident aliens. This area of the law is not rapidly change nor is it likely to rapidly change (any more rapidly than issues of technology discussed on SO, SF, or SU). "}
{"Id": 24, "PostHistoryTypeId": 2, "PostId": 13, "RevisionGUID": "2253967b-308b-4312-9008-5395faedf19a", "CreationDate": "2011-11-01T21:42:30.163", "UserId": 10, "Text": "I'm kind of torn on this. The problem as I see it, is that legality is very highly intertwined with firearm ownership. My personal thought is to _not_ close them _at this time_ and see what happens. If they are skewing toward low quality then we need to ban them otherwise I believe they would be a good addition to the site. \r\n\r\nAs far as them being too localized, I don't think they are [read Joel's answer for a good explanation](http://meta.stackoverflow.com/questions/4818/what-questions-should-be-closed-with-reason-too-localized/87415#87415) \r\n\r\nAs far as laws changing they don't really change that fast, and generally are accompanied by a large amount of fanfare for those who it effects. I think it took PA almost a year and a half to pass a \"Castle Doctrine\" bill. This is due to the fact that we do have very powerful lobbing groups. (Previous paragraph is for U.S. only I don't know about other countries)"}
{"Id": 25, "PostHistoryTypeId": 2, "PostId": 14, "RevisionGUID": "10e3ce8c-32d9-40ee-9511-a64d16217b34", "CreationDate": "2011-11-01T22:20:50.117", "UserId": 78, "Text": "It seems like there should be a general convention when making tags. Pluralized nouns don't make a good tag, in my opinion.\r\n\r\nWhat is the group consensus on tag pluralization?"}
{"Id": 26, "PostHistoryTypeId": 1, "PostId": 14, "RevisionGUID": "10e3ce8c-32d9-40ee-9511-a64d16217b34", "CreationDate": "2011-11-01T22:20:50.117", "UserId": 78, "Text": "Should plural tags be avoided?"}
{"Id": 27, "PostHistoryTypeId": 3, "PostId": 14, "RevisionGUID": "10e3ce8c-32d9-40ee-9511-a64d16217b34", "CreationDate": "2011-11-01T22:20:50.117", "UserId": 78, "Text": "<discussion><tags>"}
{"Id": 28, "PostHistoryTypeId": 2, "PostId": 15, "RevisionGUID": "ca81924e-0c82-42ef-8150-2c52c15a5e65", "CreationDate": "2011-11-01T22:38:36.583", "UserId": 103, "Text": "[This answer](http://firearms.stackexchange.com/questions/46/how-do-i-dispose-of-old-or-misfired-ammunition/52#52) for example, while useful to those in (some states in) the USA is probably not true for many other countries. It's certainly not true in my country, Ireland.\r\n\r\nSo far, a lot of the questions and answers are quite US-specific. This is perfectly understandable given the size of the USA in the English-speaking portion of the firearms universe but it might help to have some guidance on how far we want this to go."}
{"Id": 29, "PostHistoryTypeId": 1, "PostId": 15, "RevisionGUID": "ca81924e-0c82-42ef-8150-2c52c15a5e65", "CreationDate": "2011-11-01T22:38:36.583", "UserId": 103, "Text": "How should we deal with location/jurisdiction-dependent answers?"}
{"Id": 30, "PostHistoryTypeId": 3, "PostId": 15, "RevisionGUID": "ca81924e-0c82-42ef-8150-2c52c15a5e65", "CreationDate": "2011-11-01T22:38:36.583", "UserId": 103, "Text": "<discussion>"}
{"Id": 31, "PostHistoryTypeId": 2, "PostId": 16, "RevisionGUID": "568709a4-cc5e-4785-ac5a-2a3bf66221d3", "CreationDate": "2011-11-01T22:41:58.937", "UserId": 37, "Text": "I vote no on plural tags. Don't like them. "}
{"Id": 32, "PostHistoryTypeId": 2, "PostId": 17, "RevisionGUID": "d89f49bd-3e2b-4bf4-b59e-5ad5c10654f7", "CreationDate": "2011-11-01T22:42:06.843", "UserId": 19, "Text": "I'm inclined to allow it, especially for federal-level law and things that rarely change and are unlikely to change soon. Our community is somewhat unique in that there are a tremendous number of laws that the unwary can get snagged in, and I think it's to the benefit of everyone to spread basic knowledge on what's legal and what's illegal, and how to enjoy our hobby while obeying the law.\r\n\r\nThere are caveats, though. Do we have to worry about StackExchange facing some sort of liability if someone reads an incorrect interpretation and does something illegal? Do we need a specific disclaimer that nobody on here is your lawyer, and you need to speak to your lawyer for a reliable opinion on the law? And of course, we don't want to let discussions on the current law stray into political discussions, i.e. advocacy for or against any specific law, candidate, or political party.\r\n\r\nI also wanted to start posting some stuff about NFA and how to get and use Title II items legally."}
{"Id": 33, "PostHistoryTypeId": 2, "PostId": 18, "RevisionGUID": "8ba3ac4f-e284-48d3-84c7-9c0e41dd5ea0", "CreationDate": "2011-11-01T22:54:48.000", "UserId": 78, "Text": "I have seen a number of tags of the form \"firearms-{something}\". I think this is unnecessary.\r\n\r\nShould we remove such tags, replacing them with the tag \"{something}\" based on what the original tagger intended?"}
{"Id": 34, "PostHistoryTypeId": 1, "PostId": 18, "RevisionGUID": "8ba3ac4f-e284-48d3-84c7-9c0e41dd5ea0", "CreationDate": "2011-11-01T22:54:48.000", "UserId": 78, "Text": "Should hyphenated tags be avoided?"}
{"Id": 35, "PostHistoryTypeId": 3, "PostId": 18, "RevisionGUID": "8ba3ac4f-e284-48d3-84c7-9c0e41dd5ea0", "CreationDate": "2011-11-01T22:54:48.000", "UserId": 78, "Text": "<discussion><tags>"}
{"Id": 36, "PostHistoryTypeId": 2, "PostId": 19, "RevisionGUID": "e4acefbd-3041-4c8f-9155-5313a0e91139", "CreationDate": "2011-11-02T01:38:25.483", "UserId": 26, "Text": "What does the tag \"safety\" represent? I ask because I recently asked a question and tagged it \"safety\" because the question pertained to a (specific) gun's safety mechanism. Subsequently I noticed that all the other questions tagged as such were on the topic of being safe with firearms.\r\n\r\nIt doesn't matter to me a great deal, other than wanting to tag my own questions correctly. If the conventional wisdom says that the \"safety\" tag relates to safe gun handling, I might wish to remove that tag from my question."}
{"Id": 37, "PostHistoryTypeId": 1, "PostId": 19, "RevisionGUID": "e4acefbd-3041-4c8f-9155-5313a0e91139", "CreationDate": "2011-11-02T01:38:25.483", "UserId": 26, "Text": "What does the tag \"safety\" represent or does it not matter?"}
{"Id": 38, "PostHistoryTypeId": 3, "PostId": 19, "RevisionGUID": "e4acefbd-3041-4c8f-9155-5313a0e91139", "CreationDate": "2011-11-02T01:38:25.483", "UserId": 26, "Text": "<discussion><tags>"}
{"Id": 39, "PostHistoryTypeId": 2, "PostId": 20, "RevisionGUID": "e0121375-4f71-404a-b5b5-eba61275167c", "CreationDate": "2011-11-02T01:51:18.137", "UserId": 79, "Text": "It seems that most people have used the safety tag to refer to safe gunhandling practices.  However, this doesn't really leave an obvious, pithy tag to refer to mechanical safety mechanisms.   One option might be to retag most of those questions \"gun safety\", leaving \"safety\" for the mechanism, but that seems to be going against what people expect."}
{"Id": 40, "PostHistoryTypeId": 2, "PostId": 21, "RevisionGUID": "d9548f75-598d-465f-aa03-0260a077ba2c", "CreationDate": "2011-11-02T02:04:54.017", "UserId": 48, "Text": "As a rule of thumb, go with the shortest, clearest tag that describes the concept unambiguously. So for a firearms site, prefixes like \"firearm-\" and \"gun-\" are probably unnecessary...\r\n\r\n...Except when they aren't. For instance, [safety could mean a couple of different things.](http://meta.firearms.stackexchange.com/questions/19/what-does-the-tag-safety-represent-or-does-it-not-matter)"}
{"Id": 41, "PostHistoryTypeId": 2, "PostId": 22, "RevisionGUID": "42d3b453-4430-42ca-8e97-36c6a21310b4", "CreationDate": "2011-11-02T02:13:10.760", "UserId": 65, "Text": "When replying to legality-based questions, perhaps it would be wise to submit a time stamp?  \"This information accurate to the federal laws as of Nov 1, 2011\""}
{"Id": 42, "PostHistoryTypeId": 2, "PostId": 23, "RevisionGUID": "3a25482e-d121-4761-b7fc-d1c9ff4772fb", "CreationDate": "2011-11-02T02:55:12.557", "UserDisplayName": "user116", "Text": "May be early for synonyms but I really think that the tag \"sight\" should be \"sights\" if it refers to a targeting system. \"Sight\" could refer to shooting goggles."}
{"Id": 43, "PostHistoryTypeId": 1, "PostId": 23, "RevisionGUID": "3a25482e-d121-4761-b7fc-d1c9ff4772fb", "CreationDate": "2011-11-02T02:55:12.557", "UserDisplayName": "user116", "Text": "How should we tag targeting systems"}
{"Id": 44, "PostHistoryTypeId": 3, "PostId": 23, "RevisionGUID": "3a25482e-d121-4761-b7fc-d1c9ff4772fb", "CreationDate": "2011-11-02T02:55:12.557", "UserDisplayName": "user116", "Text": "<discussion><tags><tag-synonyms>"}
{"Id": 45, "PostHistoryTypeId": 2, "PostId": 24, "RevisionGUID": "99941481-2cd0-4817-b986-517e9697be18", "CreationDate": "2011-11-02T03:12:59.587", "UserId": 78, "Text": "I think \"optics\" would be a reasonable tag to use."}
{"Id": 46, "PostHistoryTypeId": 2, "PostId": 25, "RevisionGUID": "5719aded-a53e-4210-b6b2-ceefc080eda9", "CreationDate": "2011-11-02T03:18:05.057", "UserId": 78, "Text": "I think if the question is location-specific, then location-specific answers should be acceptable.\r\n\r\nIn a post where the question is too general and would require location-specific answers, I think the question should be re-phrased to be location-specific.\r\n\r\nVague questions yield vague answers, and that should be avoided to keep the value of this stack high."}
{"Id": 47, "PostHistoryTypeId": 2, "PostId": 26, "RevisionGUID": "6e1041c5-d5fe-4f14-a784-225a320ef5a8", "CreationDate": "2011-11-02T03:25:14.750", "UserId": 78, "Text": "Questions of legality are too often in flux for a static answer to remain relevant and correct. They are also too location-specific to be of general use. Do we want 50 posts, one for each state in the US, about whether it's legal to carry concealed in a restaurant that serves alcohol? For how long would any of those answers remain correct, if they were even correct to start with.\r\n\r\nThe bigger question is \"what is the value of such an answer\"?  Can a community member act in reliance upon that information? Is the person answering the question an attorney? Will they cite case law? \r\n\r\nIt seems like every answer would have to start with \"IANAL, but....\" and end with \"but be sure to check your local laws before doing X.\" What's the point?\r\n\r\nI would vote to make these kinds of questions impermissible here."}
{"Id": 48, "PostHistoryTypeId": 5, "PostId": 24, "RevisionGUID": "8d5dd3db-4872-4e61-bdc5-d71dc868689f", "CreationDate": "2011-11-02T03:42:38.613", "UserId": 78, "Comment": "I am clarifying and expanding my answer.", "Text": "I think \"optic\" would be a reasonable tag to use when tagging a post that is about \"optical\" sighting systems like a red-dot, holographic or scope sight.\r\n\r\nI will propose \"iron-sight\", \"open-sight\" and \"peep-sight\" as reasonable tags for those kinds of sights."}
{"Id": 49, "PostHistoryTypeId": 5, "PostId": 24, "RevisionGUID": "79feaf2a-14d4-4530-9abc-52c939271964", "CreationDate": "2011-11-02T03:52:20.647", "UserId": 78, "Comment": "More expansion and clarification", "Text": "I think \"optic\" or \"scope\" would be reasonable tags to use when tagging a post that is about optical sighting systems like a red-dot, holographic or scope sight.\r\n\r\nI will propose \"iron-sight\", \"open-sight\" and \"peep-sight\" as reasonable tags for those kinds of sights."}
{"Id": 50, "PostHistoryTypeId": 2, "PostId": 27, "RevisionGUID": "9ef35f00-1596-4e92-a3ed-4091c86dfb40", "CreationDate": "2011-11-02T04:28:00.373", "UserId": 125, "Text": "Location-specific is a very important aspect of firearms. Laws differ at every level of government.\r\n\r\nIn the event answer lacks applicability to a given locale then it may be easily commented as such, or a separate answer may be given.\r\n\r\nLooking at your example, I was able to easily infer the locality and caveats of the answer by reading the first two comments. Over time, good comments like these will be upvoted and easy observable, separate from conversational comments. Further, the author can choose to enhance their answer by appending it with locale-specific information. Further yet, if there's specific locale information, another answer may be given.\r\n\r\nThe point is, information types such as this is incredibly useful and should not be limited simply because someone may have to use their brain when viewing it."}
{"Id": 51, "PostHistoryTypeId": 2, "PostId": 28, "RevisionGUID": "d498401f-a445-4650-ad75-7573a2f18cbf", "CreationDate": "2011-11-02T15:15:22.917", "UserId": 95, "Text": "I retagged your question with [tag:safety-mechanism]. The majority of \"safety\" issues will be about gun safety. Now when the user tag their question with \"s-a-f-e-t-y&hellip;\", the text completion will show *both* entries: 'safety' and 'safety-mechanism'. \r\n\r\nGo create a good tag wiki for both those entries. Clearly define the purpose of both these tags. That should take care of the majority of problems. Good community moderation should take care of the rest."}
{"Id": 52, "PostHistoryTypeId": 2, "PostId": 29, "RevisionGUID": "7600c9e3-73d7-42c2-8d50-e116b4b06d05", "CreationDate": "2011-11-02T15:36:23.110", "UserId": 124, "Text": "I need a good example or two before I can weigh in."}
{"Id": 53, "PostHistoryTypeId": 2, "PostId": 30, "RevisionGUID": "274df4bc-5d67-4247-950f-01b47ac41b95", "CreationDate": "2011-11-02T16:44:14.133", "UserId": 24, "Text": "I have created a [tag:gun-safety] tag and applied it to all the entries that were tagged as [tag:safety] and related to gun safety."}
{"Id": 54, "PostHistoryTypeId": 2, "PostId": 31, "RevisionGUID": "e8c8d2be-1094-42b5-9c28-675b170b62cb", "CreationDate": "2011-11-02T16:46:37.000", "UserId": 24, "Text": "Is it possible to propose the removal of a tag? Specifically, we should remove [tag:safety] as it is an ambiguous term within Firearms. It has been replaced with [tag:gun-safety] and [tag:safety-mechanism]."}
{"Id": 55, "PostHistoryTypeId": 1, "PostId": 31, "RevisionGUID": "e8c8d2be-1094-42b5-9c28-675b170b62cb", "CreationDate": "2011-11-02T16:46:37.000", "UserId": 24, "Text": "Propose removal of a tag"}
{"Id": 56, "PostHistoryTypeId": 3, "PostId": 31, "RevisionGUID": "e8c8d2be-1094-42b5-9c28-675b170b62cb", "CreationDate": "2011-11-02T16:46:37.000", "UserId": 24, "Text": "<feature-request>"}
{"Id": 57, "PostHistoryTypeId": 2, "PostId": 32, "RevisionGUID": "5426c360-0d52-470e-b92e-70dc6c62cc94", "CreationDate": "2011-11-02T17:24:47.423", "UserId": 48, "Text": "Since all the questions using it have been re-tagged, it'll be automatically deleted in a day. \r\n\r\nIf you'd prefer, we can make it a *synonym* of one of those other tags (meaning anyone using it will see it automatically converted into a more specific tag). "}
{"Id": 58, "PostHistoryTypeId": 2, "PostId": 33, "RevisionGUID": "fe355b40-ea71-43cb-a6d0-044e9ab85b7c", "CreationDate": "2011-11-02T17:37:24.130", "UserId": 95, "Text": "There are some very sparse questions titles on this site that do not convey what the question is actually about. A page full of titles like:\r\n\r\n- Cleaning Solvents\r\n- Holographic Sights\r\n- Decocking handguns\r\n- Tactical Mossburg 500 sights\r\n\r\n&hellip; are like the neglected edifice of a restaurant that isn't particularly inviting for anyone to come in to try out the great food. They reflect poorly on this site.\r\n\r\nQuestion titles are hugely important. Most users will find this site through search, and the question titles are the primary means users will find your content. The [listing of questions on your front page](http://firearms.stackexchange.com) is the *de facto* design that invites people to stick around; That you're asking some particularly intriguing questions here! It should be pristine and awesome.\r\n\r\nPlease go through and clean up the questions while this site is still in private beta. Some of the question bodies can use some work, too. This should be an ongoing effort as part of your community self-moderation. Without it, quality will suffer and this site will fail. \r\n\r\nOpinions vary about just how literal the title of the question needs to be, but the title should at least convey what the question is about. At the bottom of every question is a link to **'improve this question'**. Please use it."}
{"Id": 59, "PostHistoryTypeId": 1, "PostId": 33, "RevisionGUID": "fe355b40-ea71-43cb-a6d0-044e9ab85b7c", "CreationDate": "2011-11-02T17:37:24.130", "UserId": 95, "Text": "Call to Editors - Titles Need Improvement"}
{"Id": 60, "PostHistoryTypeId": 3, "PostId": 33, "RevisionGUID": "fe355b40-ea71-43cb-a6d0-044e9ab85b7c", "CreationDate": "2011-11-02T17:37:24.130", "UserId": 95, "Text": "<discussion><featured><title>"}
{"Id": 61, "PostHistoryTypeId": 5, "PostId": 33, "RevisionGUID": "03bed6ad-dd38-4a44-a7db-69469b9f00d4", "CreationDate": "2011-11-02T17:44:02.547", "UserId": 95, "Comment": "added 61 characters in body", "Text": "There are some very sparse questions titles on this site that do not convey what the question is actually about. A page full of titles like:\r\n\r\n- Cleaning Solvents\r\n- Holographic Sights\r\n- Decocking handguns\r\n- Tactical Mossburg 500 sights\r\n\r\n&hellip; are like the neglected edifice of a restaurant that isn't particularly inviting for anyone to come in to try out the great food. They reflect poorly on this site.\r\n\r\nOpinions vary about just how literal the title of the question needs to be, but the title should at least convey what the question is about. \r\n\r\nQuestion titles are hugely important. Most users will find this site through search, and the question titles are the primary means users will find your content. The [listing of questions on your front page](http://firearms.stackexchange.com) is the *de facto* design that invites people to stick around; That you're asking some particularly intriguing questions here! It should be pristine and awesome.\r\n\r\nPlease go through and clean up the questions while this site is still in private beta. Some of the question bodies can use some work, too. This should be an ongoing effort as part of your community self-moderation. Without it, quality will suffer and this site will fail. \r\n\r\nAt the bottom of every question is a link to **'improve this question'**. Please use it and let's see if we can rein in the quality issues early on."}
{"Id": 62, "PostHistoryTypeId": 2, "PostId": 34, "RevisionGUID": "069ab273-e304-41ef-978b-658c8bb8c812", "CreationDate": "2011-11-02T17:55:05.213", "UserId": 85, "Text": "Some calibers have multiple names that seem to be equally popular.  One example is the 7.62 NATO round.  Some call it \"7.62 NATO\", while others call it \"7.62x51\".  You could also say \"7.62x51mm\" or even just \"7.62\" (seems like some folks treat the \"NATO\" part as implied when the cartridge length is not mentioned, but this always felt ambiguous to me).\r\n\r\nSo this could be tagged as:\r\n\r\n* 7.62nato\r\n* 7.62-nato\r\n* 7.62x51\r\n* 7.62x51mm\r\n* and so on...\r\n\r\nDo we want to establish a tagging standard for calibers like this?"}
{"Id": 63, "PostHistoryTypeId": 1, "PostId": 34, "RevisionGUID": "069ab273-e304-41ef-978b-658c8bb8c812", "CreationDate": "2011-11-02T17:55:05.213", "UserId": 85, "Text": "What format should we use for ammo tags?"}
{"Id": 64, "PostHistoryTypeId": 3, "PostId": 34, "RevisionGUID": "069ab273-e304-41ef-978b-658c8bb8c812", "CreationDate": "2011-11-02T17:55:05.213", "UserId": 85, "Text": "<discussion><tags>"}
{"Id": 65, "PostHistoryTypeId": 6, "PostId": 31, "RevisionGUID": "82afdcf3-8933-41ab-af77-1fcaac4b5258", "CreationDate": "2011-11-02T18:14:17.610", "UserId": 48, "Comment": "edited tags", "Text": "<feature-request><status-completed><tags>"}
{"Id": 66, "PostHistoryTypeId": 2, "PostId": 35, "RevisionGUID": "5e0cb391-2f9a-45e2-ae57-7d6d29c93140", "CreationDate": "2011-11-02T20:03:40.187", "UserId": 51, "Text": "I'd like to ask a question about the steps one has to go through to buy and be able to use a handgun in Canada. Is this too localized?"}
{"Id": 67, "PostHistoryTypeId": 1, "PostId": 35, "RevisionGUID": "5e0cb391-2f9a-45e2-ae57-7d6d29c93140", "CreationDate": "2011-11-02T20:03:40.187", "UserId": 51, "Text": "Is talk about country-specific procedures okay?"}
{"Id": 68, "PostHistoryTypeId": 3, "PostId": 35, "RevisionGUID": "5e0cb391-2f9a-45e2-ae57-7d6d29c93140", "CreationDate": "2011-11-02T20:03:40.187", "UserId": 51, "Text": "<discussion>"}
{"Id": 69, "PostHistoryTypeId": 2, "PostId": 36, "RevisionGUID": "7c150a9b-4785-4794-9c69-8d6c5ab64665", "CreationDate": "2011-11-02T20:29:30.507", "UserDisplayName": "user116", "Text": "The closest things to this issue on another SE site that I have seen are the issues of distributing homebrew and manufacturing distilled spirits that come up on the Homebrewing site every so often. Generally, the questions are allowed, but the answers that remain are those that refer the questioner to consult specific references in the US Code. This is different because there is only one prevailing jurisdiction in the case of alcohol manufacturing and distribution.\r\n\r\nIf we are going to allow these questions, there should be a tag of \"for-educational-purposes-only\" or \"not-seeking-actionable-legal advice\" that the moderators should monitor and apply. :-)"}
{"Id": 70, "PostHistoryTypeId": 2, "PostId": 37, "RevisionGUID": "e2e1e84f-ef1c-4581-8044-b36ce9b6a011", "CreationDate": "2011-11-02T20:36:44.960", "UserDisplayName": "user116", "Text": "There is already emerging a consistent answering pattern here that suggests that when choosing a shotgun load for self-defense, you want to go with what will kill or severely maim the adversary. Several statements have been made that imply or directly state that bird shot should never be used for self-defense because it lacks penetration. It seems that the assumption is that self-defense implies lethality.\r\n\r\nI know that definition questions/answers are not allowed and debates are to be avoided. I just wonder how this issue (or should for that matter) should be addressed? Suggestions?"}
{"Id": 71, "PostHistoryTypeId": 1, "PostId": 37, "RevisionGUID": "e2e1e84f-ef1c-4581-8044-b36ce9b6a011", "CreationDate": "2011-11-02T20:36:44.960", "UserDisplayName": "user116", "Text": "Assumption of lethality in self-defense answers"}
{"Id": 72, "PostHistoryTypeId": 3, "PostId": 37, "RevisionGUID": "e2e1e84f-ef1c-4581-8044-b36ce9b6a011", "CreationDate": "2011-11-02T20:36:44.960", "UserDisplayName": "user116", "Text": "<discussion>"}
{"Id": 73, "PostHistoryTypeId": 2, "PostId": 38, "RevisionGUID": "a8125a71-d96d-4afe-b53f-21ea615cf946", "CreationDate": "2011-11-02T20:59:43.877", "UserId": 78, "Text": "I'm not sure what issue you're trying to address, but as a general rule, when shooting for self-defense, you want to \"stop the threat\". The best way to stop a threat is to completely disable the attacker. \r\n\r\nIf you merely injure an attacker, the threat may continue, which is undesirable.\r\n\r\nIf you totally disrupt the central nervous system or circulatory system of an attacker, it is unlikely that the threat will continue.\r\n\r\nThe issue of birdshot as an inadequate round for self-defense stems from the idea that it may only injure an attacker. If it lacks sufficient penetration to disrupt the central nervous system by severing the spine, or disrupt the circulatory system by stopping the heart, it is unlikely to completely stop a threat.\r\n"}
{"Id": 75, "PostHistoryTypeId": 2, "PostId": 40, "RevisionGUID": "6a4bc188-df75-4d3a-9ef5-acadb72b9516", "CreationDate": "2011-11-02T21:04:38.957", "UserId": 78, "Text": "In your example, 7.62 by itself would certainly be ambiguous, as it could refer to x39 or x51 or x54r.\r\n\r\nThe general guideline is to use the shortest tag that clearly represents the concept.\r\n\r\nI would propose 7.62×51 as the tag for this ammo.\r\n\r\nTo answer your specific question, I think it would be wise to create a set of standard \"seed\" tags for the most common ammo, but that an exhaustive list would be tedious to create."}
{"Id": 76, "PostHistoryTypeId": 2, "PostId": 41, "RevisionGUID": "dc0b3528-0b11-4567-be64-397e18ce0d0d", "CreationDate": "2011-11-02T21:31:31.823", "UserId": 17, "Text": "If we leave off \"mm\" for rifle calibers, do we leave it off for pistol calibers too? Then we'd just have \"9\" or \"10\" for 9mm and 10mm. So either we include \"mm\" on both or drop it for rifle.\r\n\r\nThere might be a balance between using the technically correct designation and what is commonly used and understood. \"9mm\" is commonly used as a synonym for 9x19mm or 9mm Para, but even that is ambiguous with 9x18mm Makarov. Then you get weird stuff like 8mm Mauser which is commonly used in the US, but 8x57mm and 7.92x57mm are used too.\r\n\r\nIf we had a wiki for the standardized tags (can you make a wiki in meta?) we could standardize the top 20 or 30 popular calibers and use that list as a guideline for more obscure cartridges."}
{"Id": 77, "PostHistoryTypeId": 2, "PostId": 42, "RevisionGUID": "efd48706-b95e-46db-90fc-48e7b590caad", "CreationDate": "2011-11-02T22:10:55.317", "UserId": 47, "Text": "The lack of adequate information was intenitional.  To quote the OP (posted in a comment after I indicated that the question could potentially be re-opened if sufficient detail were applied):\r\n\r\n> It was as specific as I wanted to ask,\r\n\r\nThe question *can't* be answered in its current form, for reasons already explained both in comments to the question and here in meta.  *Every* Stack site closes unanswerable questions -- it's even a close reason, and in our FAQ [here](http://firearms.stackexchange.com/faq#dontask)\r\n\r\n> You should only ask practical, answerable questions based on actual problems that you face. Chatty, open-ended questions diminish the usefulness of our site and push other questions off the front page.\r\n\r\nand [here](http://firearms.stackexchange.com/faq#close)\r\n\r\n> **not a real question**  \r\nIt's difficult to tell what is being asked here. This question is ambiguous, vague, incomplete, or rhetorical and cannot be reasonably answered in its current form.\r\n\r\nSo, we're dealing with a question suitability question (i.e. is the question in a form that fits the Stack format) not scope (i.e. is the question on-topic for this SE site in particular).\r\n\r\nWhen you sit down to ask a problem, try to focus on the concrete results you want from getting the one correct answer.  If there's no one correct answer, or there's no result once you have that answer, it's probably a bad question."}
{"Id": 79, "PostHistoryTypeId": 2, "PostId": 44, "RevisionGUID": "8c65865d-8c0e-4ae0-bbfa-393363fa38be", "CreationDate": "2011-11-03T01:15:59.667", "UserId": 26, "Text": "Well, the tag \"safety-mechanism\" was my original thought and suggestion, but now I want to change it again.\r\n\r\nI was doing a little research on the topic with a mind towards contributing to the wiki for the \"safety-mechanism\" tag and I see that the Wikipedia article on [firearm safeties](http://en.wikipedia.org/wiki/Safety_(firearms)) says this:\r\n\r\n> In firearms, a safety or **safety catch** is a mechanism used to help prevent the accidental discharge of a firearm...\r\n\r\nSimilarly, Dictionary.com references \"safety catch\" as a synonym of the term [\"safety\"](http://dictionary.reference.com/browse/safety) (as it applies to the topic at hand).\r\n\r\nThis makes me want to change the \"safety-mechanism\" tag to \"safety-catch\". If there are no objections, I may try to make that happen."}
{"Id": 80, "PostHistoryTypeId": 5, "PostId": 35, "RevisionGUID": "c6ac82a2-0c75-42c8-bd06-d0bb351f5325", "CreationDate": "2011-11-03T03:14:55.303", "UserId": -1, "Comment": "insert duplicate link", "Text": "> **Possible Duplicate:**  \n> [How should we deal with location/jurisdiction-dependent answers?](http://meta.firearms.stackexchange.com/questions/15/how-should-we-deal-with-location-jurisdiction-dependent-answers)  \n\n<!-- End of automatically inserted text -->\n\nI'd like to ask a question about the steps one has to go through to buy and be able to use a handgun in Canada. Is this too localized?"}
{"Id": 81, "PostHistoryTypeId": 10, "PostId": 35, "RevisionGUID": "216614f8-253f-415e-b7e6-6f7a500377a8", "CreationDate": "2011-11-03T03:14:53.477", "UserId": 14, "CloseReasonId": 1, "Text": "[{\"Id\":78,\"DisplayName\":\"dgm\"},{\"Id\":14,\"DisplayName\":\"Dori\"}]"}
{"Id": 82, "PostHistoryTypeId": 2, "PostId": 45, "RevisionGUID": "31d62d84-97ab-46d1-8e4a-e6e7b5e2ab41", "CreationDate": "2011-11-03T04:04:46.073", "UserId": 47, "Text": "Birdshot is a ridiculously poor choice for self-defense: someone amped up on drugs can take a round of it and keep coming at you.\r\n\r\nIf you are intent on using a firearm in a non-lethal way, you should not be using a shotgun, period.  In theory, a suitably accurate pistol-wielder could shoot out an intruder's knees in a home defense situation.  However, in my not-so-humble opinion: don't pull a gun if you aren't resigned to the fact that you may have to kill.  Getting a clean shot at someone's knees requires that their knees be still enough, you have clear line of sight, and a whole bunch of other factors that may not be present.\r\n\r\nIf you feel that suggested answers to a question are focused on lethal approaches that may not be necessary, by all means offer your own answer.  However, if you feel that *all* self-defense scenarios that require discharge of a firearm can be ended non-lethally, you are extrmely unrealistic in your expectations."}
{"Id": 83, "PostHistoryTypeId": 2, "PostId": 46, "RevisionGUID": "95dac516-0dfd-4605-a876-f6eb4a0c422e", "CreationDate": "2011-11-03T04:29:21.253", "UserId": 79, "Text": "Legally speaking, using a firearm is deadly force.  Even if your stated intent was only to wound someone, your justification for doing so will be judged in the context of deadly force.\r\n\r\nAs a practical matter, there are five ways to use a firearm to stop an attacker:\r\n\r\n1. Fear\r\n2. Pain\r\n3. Destroy the brainstem\r\n4. Sever the spinal cord above where it controls the hands\r\n5. Lower the blood pressure to the brain by either (a) letting a lot of blood out or (b) destroying the heart.\r\n\r\nOf these, only 3, 4, and 5 can be considered reliable against a determined attacker.  These three are either certainly lethal (destroying the brainstem or the heart) or likely to be so (severing the spinal cord or massive blood loss).  \r\n\r\nThe bottom line is any tactic, technique, or equipment for self defense with a firearm that will reliably stop a determined attacker is going to be potentially lethal."}
{"Id": 84, "PostHistoryTypeId": 2, "PostId": 47, "RevisionGUID": "846a59d7-1957-4b8a-8a71-d82eff2ed34c", "CreationDate": "2011-11-03T04:38:48.573", "UserId": 47, "Text": "A concerning number of questions I've seen so far are, though not badly formulated, extremely beginner questions.  For example:\r\n\r\n- [Basic safety rules for beginners on ranges](http://firearms.stackexchange.com/q/199/47)\r\n- [How many rounds should I fire to determine whether my defensive handgun is reliable enough?](http://firearms.stackexchange.com/q/129/47)\r\n- [Firearms safety around young children](http://firearms.stackexchange.com/q/49/47)\r\n- [How do I dispose of old or misfired ammunition?](http://firearms.stackexchange.com/q/46/47)\r\n- [What should I look for in a firearms training course?](http://firearms.stackexchange.com/q/70/47)\r\n- [How do I sight-in a rifle?](http://firearms.stackexchange.com/q/213/47)\r\n- [How often should I clean my pistol?](http://firearms.stackexchange.com/q/221/47)\r\n- [What supplies and equipment would I need in order to get started reloading ammunition?](http://firearms.stackexchange.com/q/200/47)\r\n- [What is trap versus skeet?](http://firearms.stackexchange.com/q/247/47)\r\n- [Is there any real danger in chambering the same round multiple times without firing it?](http://firearms.stackexchange.com/q/117/47)\r\n- [What is the procedure to adjust sights on a pistol?](http://firearms.stackexchange.com/q/92/47)\r\n- [What does “single action” mean?](http://firearms.stackexchange.com/q/68/47)\r\n- [What is the proper technique to clean a Glock pistol?](http://firearms.stackexchange.com/q/29/47)\r\n- [How often should one unload a magazine when a pistol is stored for long periods of time?](http://firearms.stackexchange.com/q/38/47)\r\n- [What is the forward assist on an AR for?](http://firearms.stackexchange.com/q/11/47)\r\n\r\nIf the site were live and home to a thriving community of experts, these would be no big deal.  However there's a reason you click-through that long disclaimer about beta-worthy questions before asking something during private beta:\r\n\r\n**The questions we ask right now will determine our ability to attract experts.**\r\n\r\nRight now, a significant portion of our unclosed questions are absolute beginner stuff.  If we continue allowing these questions during our private beta, it is quite likely that beginner content will be the majority of what we get when the site goes public.  That doesn't make Firearms.SE an intriguing place for experts to hang out.\r\n\r\nAttracting experts means asking specific, long-tail questions, or complex questions that require a serious understanding of firearm/ammunition manufacture and use.  I know that not every question will be something John Browning can't help but rise from his grave and answer, but we should at least avoid all of the extremely basic stuff until our community is more established."}
{"Id": 85, "PostHistoryTypeId": 1, "PostId": 47, "RevisionGUID": "846a59d7-1957-4b8a-8a71-d82eff2ed34c", "CreationDate": "2011-11-03T04:38:48.573", "UserId": 47, "Text": "Are we asking private-beta-worthy questions?"}
{"Id": 86, "PostHistoryTypeId": 3, "PostId": 47, "RevisionGUID": "846a59d7-1957-4b8a-8a71-d82eff2ed34c", "CreationDate": "2011-11-03T04:38:48.573", "UserId": 47, "Text": "<discussion><private-beta><content-quality>"}
{"Id": 87, "PostHistoryTypeId": 5, "PostId": 42, "RevisionGUID": "3fc7e9cc-6d74-460d-b509-c8561fe52c00", "CreationDate": "2011-11-03T04:42:12.670", "UserId": 47, "Comment": "added 1 characters in body", "Text": "The lack of adequate information was intenitional.  To quote the OP (posted in a comment after I indicated that the question could potentially be re-opened if sufficient detail were applied):\r\n\r\n> It was as specific as I wanted to ask,\r\n\r\nThe question *can't* be answered in its current form, for reasons already explained both in comments to the question and here in meta.  *Every* Stack site closes unanswerable questions -- it's even a close reason, and in our FAQ [here](http://firearms.stackexchange.com/faq#dontask)\r\n\r\n> You should only ask practical, answerable questions based on actual problems that you face. Chatty, open-ended questions diminish the usefulness of our site and push other questions off the front page.\r\n\r\nand [here](http://firearms.stackexchange.com/faq#close)\r\n\r\n> **not a real question**  \r\nIt's difficult to tell what is being asked here. This question is ambiguous, vague, incomplete, or rhetorical and cannot be reasonably answered in its current form.\r\n\r\nSo, we're dealing with a question suitability question (i.e. is the question in a form that fits the Stack format) not scope (i.e. is the question on-topic for this SE site in particular).\r\n\r\nWhen you sit down to ask a question, try to focus on the concrete results you want from getting the one correct answer.  If there's no one correct answer, or there's no result once you have that answer, it's probably a bad question."}
{"Id": 88, "PostHistoryTypeId": 2, "PostId": 48, "RevisionGUID": "e1da09da-9c53-4506-8f3e-1630746a541d", "CreationDate": "2011-11-03T19:04:53.387", "UserId": 99, "Text": "I'm inclined to agree and unfortunately, as a beginner myself, I don't have a good example of an expert-level question.  That said, some of those questions can be answered via a very simple Google search, which, IMO lessens the value of this site. The problem I have with them is more that the OP should have Googled \"Trap vs Skeet\" and would have found a very definitive answer.  To me, that's on par with asking \"What does 'public' mean in Java\" on Stackoverflow. It's a sign, to me at least, that the person is either lazy, or more likely in this case, just trying to ask questions to either fill the database or pad their reputation by asking the easy questions before they've been exhausted. \r\n\r\nTo me, the bar should be \"what kind of question would actually benefit from having an expert answer it?\" Or, put differently, if I have a Navy SEAL standing in front of me and I only get to ask him one question, would I ask him what the difference between trap and skeet is or would I think through it a little more?"}
{"Id": 89, "PostHistoryTypeId": 2, "PostId": 49, "RevisionGUID": "c1e4a6e0-537e-432a-82b5-dc5aa1476789", "CreationDate": "2011-11-06T18:25:19.900", "UserDisplayName": "user116", "Text": "I can understand the concern, but now you have editing that is changing the nature of the original question asked. Is there a FAQ on the do's and don'ts of editing?"}
{"Id": 90, "PostHistoryTypeId": 2, "PostId": 50, "RevisionGUID": "b7ccf88b-2070-40df-9bef-1f546fd3901c", "CreationDate": "2011-11-06T20:35:23.623", "UserId": 78, "Text": "I've been going through and putting in suggested edits to titles. I don't have editor privileges yet, so my suggestions go into a queue. I notice that somebody has been accepting my changes though, so it seems like things are working as they should.\r\n\r\nAs far as editing goes, it's a judgment call. I think edits for clarity, spelling, punctuation and such are appropriate. But you shouldn't be changing the overall intent of the question, in my opinion."}
{"Id": 91, "PostHistoryTypeId": 2, "PostId": 51, "RevisionGUID": "6c780e25-51d6-4bd6-963c-3d303c50cf12", "CreationDate": "2011-11-07T01:35:47.360", "UserId": 78, "Text": "With firearms, I think it's tough to have \"expert\" level questions unless the person asking is at least _very_ knowledgeable. There are tons of novice gun owners out there, but they don't even know what they don't know.\r\n\r\n"}
{"Id": 92, "PostHistoryTypeId": 2, "PostId": 52, "RevisionGUID": "48affb8f-91fc-40c5-9ea7-05ca54d81687", "CreationDate": "2011-11-07T04:45:06.497", "UserId": 121, "Text": "How should we separate tags about *reloading* (the activity of **putting new bullets into old brass**) from tags about *reloading* (the activity of **putting more ammunition in your firearm**)?"}
{"Id": 93, "PostHistoryTypeId": 1, "PostId": 52, "RevisionGUID": "48affb8f-91fc-40c5-9ea7-05ca54d81687", "CreationDate": "2011-11-07T04:45:06.497", "UserId": 121, "Text": "Tagging \"Reloading\" (changing magazines) vs \"Reloading\" (re-using brass)"}
{"Id": 94, "PostHistoryTypeId": 3, "PostId": 52, "RevisionGUID": "48affb8f-91fc-40c5-9ea7-05ca54d81687", "CreationDate": "2011-11-07T04:45:06.497", "UserId": 121, "Text": "<discussion><tags>"}
{"Id": 95, "PostHistoryTypeId": 2, "PostId": 53, "RevisionGUID": "d8fa90a9-ab8c-4d56-8a41-b06dc1fbf79a", "CreationDate": "2011-11-07T13:23:10.073", "UserId": 37, "Text": "reloading-cartridge and reloading-firearm? It's the first thing that came to mind. I think it's pretty weak though."}
{"Id": 96, "PostHistoryTypeId": 2, "PostId": 54, "RevisionGUID": "27faeae5-9e92-45b1-83ae-cff04fdc670e", "CreationDate": "2011-11-07T13:55:46.467", "UserId": 79, "Text": "Well, all four of the current uses of the tag seem to be related to putting new bullets into old brass.  Perhaps we ought to keep the plain old `reloading` tag for reloading cartridges and come up with something else to refer to putting more ammunition into a firearm.  `magazine-change` maybe?  Though that obviously wouldn't work for firearms without detachable magazines."}
{"Id": 97, "PostHistoryTypeId": 2, "PostId": 55, "RevisionGUID": "98b577b2-2a49-4a88-9030-c718f6cc55f2", "CreationDate": "2011-11-07T14:26:48.830", "UserId": 79, "Text": "Folks voted to close the question \"[What type of ammunition should I use for self-defense in my handgun?][1]\" as \"not constructive\", which is described as, \"This question is not a good fit to our Q&A format. We expect answers to generally involve facts, references, or specific expertise; this question will likely solicit opinion, debate, arguments, polling, or extended discussion.\"\r\n\r\nThe text of the question asked:\r\n\r\n> What are the differences between the major bullet types for handguns - Full Metal Jacket, Jacketed Hollow Point, Round Nose Lead, and Frangible - and which is the most effective for self-defense? How do I tell which brands of each type are the most effective?\r\n\r\nWhile it is at the beginner level, I think this is a pretty decent question, with an answer that involved \"facts, references, or specific expertise\".  The first part has a clear, correct, widely agreed upon answer (use JHP for self defense).  The brand portion of the question is perhaps a bit more problematic, since everyone has their favorite, but I think that it's answerable in a reasonable way.\r\n\r\nI'm less concerned about this particular question than about where we're going to draw this line on Firearms SE.  As questions on using firearms for self-defense go, what type of bullet to use in a pistol is one of the most widely agreed upon.  If it doesn't pass muster here, this isn't going to be a very good place to ask self-defense questions.\r\n\r\n  [1]: http://firearms.stackexchange.com/questions/351/what-type-of-ammunition-should-i-use-for-self-defense-in-my-handgun"}
{"Id": 98, "PostHistoryTypeId": 1, "PostId": 55, "RevisionGUID": "98b577b2-2a49-4a88-9030-c718f6cc55f2", "CreationDate": "2011-11-07T14:26:48.830", "UserId": 79, "Text": "Threshold for closing because a question is \"not constructive\""}
{"Id": 99, "PostHistoryTypeId": 3, "PostId": 55, "RevisionGUID": "98b577b2-2a49-4a88-9030-c718f6cc55f2", "CreationDate": "2011-11-07T14:26:48.830", "UserId": 79, "Text": "<discussion><close-reasons><not-constructive>"}
{"Id": 100, "PostHistoryTypeId": 2, "PostId": 56, "RevisionGUID": "c604367e-2b61-4297-9ae0-eb7d823f41f2", "CreationDate": "2011-11-07T15:12:52.657", "UserId": 78, "Text": "It's possible that many types of self-defense questions might be a bad fit for SE, given the expected format.\r\n\r\nWhile it's a great topic, and very interesting to many, it certainly does provoke a lot of very opinionated discussion in most circles. \r\n\r\n"}
{"Id": 101, "PostHistoryTypeId": 2, "PostId": 57, "RevisionGUID": "3021832e-a26d-4496-972a-92b9a36aaf3d", "CreationDate": "2011-11-07T16:55:22.217", "UserId": 17, "Text": "What about `metallic-reloading` and `shotshell-reloading`? Those terms are commonly used on online stores to categorize the two different types of reloading."}
{"Id": 102, "PostHistoryTypeId": 2, "PostId": 58, "RevisionGUID": "d114fcef-282d-4a9f-90e8-fdeb5a7c76d3", "CreationDate": "2011-11-07T21:13:00.633", "UserId": 32, "Text": "I think the strength of the \"simple\" questions that we're answering here is that they may seem simple on the surface, but there is <strong>tons of misinformation</strong> that gets passed around by other non-experts. Precisely as @dgm answered, people don't know what they don't know. \r\n\r\nThings as simple as what is the difference between a \"clip\" and a \"magazine\" may seem like a non-expert-level question, yet some self-professed \"experts\" use the term interchangeably. With this site, we have the opportunity to lay a solid foundation of \"beginner-level\" questions that dispel the myths and misinformation in an expert-level way, as well as being able to answer questions that highly knowledgeable people would consider expert-level.\r\n\r\nI'll use my answer to the \"what is twist rate\" question as an example (not to blow my own horn, but because it's front-of-mind for me): twist rate can be explained simply as \"the number of inches of barrel length required for a single revolution of the bullet.\" My answer explained (what I believe to be) an \"expert-level\" bit of knowledge in calling out that the twist rate affects bullets based on their length, and not their weight. Very few people know/realize this, in my experience. Most people just use the old \"the heavier the bullet is, the higher your twist rate must be,\" yet that's incorrect! It may be considered by some a technicality, but it lays an expert-level foundation for this site.\r\n\r\nI think we should take advantage of the ability to create a solid foundation of knowledge based on the small number of expert level answerers we have available to us now to lay the foundation of <strong>actual knowledge</strong> before the amateur horde arrives in open beta and starts answering questions with the commonly-accepted-but-oh-so-wrong knowledge that's been passed through the amateur gun community.\r\n\r\nThese answers are things that \"a simple Google search\" could as easily turn up an answer that is wrong as they could turn up an answer that is right just because of the level of bad info that's out there and constantly perpetuated."}
{"Id": 103, "PostHistoryTypeId": 5, "PostId": 58, "RevisionGUID": "e8ab0d9f-e7eb-45ee-a4ef-ed5058fb1508", "CreationDate": "2011-11-07T21:18:41.310", "UserId": 32, "Comment": "added 1150 characters in body", "Text": "I think the strength of the \"simple\" questions that we're answering here is that they may seem simple on the surface, but there is <strong>tons of misinformation</strong> that gets passed around by other non-experts. Precisely as @dgm answered, people don't know what they don't know. <strong>If we have a foundation of questions that are obviously of expert level, even to simple questions, I believe it would do more to attract experts than if we had either an unknown or known-to-be-poor level of understanding of the basics.</strong>\r\n\r\nI personally simply avoid sites where the common answer to a question about AR-15s is \"my cheap DPMS is just as good as your expensive LaRue/Bravo Company/LMT/Colt/Noveske/Daniel Defense/Knight's Armament/et al.\" because there's no point in arguing. If that community has a generally accepted answer that is wrong, it is not worth my time to come in and try to change the way the wind blows. I look for communities where, in the context of this example, quality and quality control is respected, and where the members are the kinds of people who have used these cheaper weapons, run them hard on duty and/or in training, had them fail, and \"seen the light\" on quality control for a hard use gun.\r\n\r\n<em>(That example is not an attempt to start a fight, simply an example of an expert-level opinion I have seen time and time again. It is merely an example, please take it as nothing more.)</em> \r\n\r\nThings as simple as what is the difference between a \"clip\" and a \"magazine\" may seem like a non-expert-level question, yet some self-professed \"experts\" use the term interchangeably. With this site, we have the opportunity to lay a solid foundation of \"beginner-level\" questions that dispel the myths and misinformation in an expert-level way, as well as being able to answer questions that highly knowledgeable people would consider expert-level.\r\n\r\nI'll use my answer to the \"what is twist rate\" question as an example (not to blow my own horn, but because it's front-of-mind for me): twist rate can be explained simply as \"the number of inches of barrel length required for a single revolution of the bullet.\" My answer explained (what I believe to be) an \"expert-level\" bit of knowledge in calling out that the twist rate affects bullets based on their length, and not their weight. Very few people know/realize this, in my experience. Most people just use the old \"the heavier the bullet is, the higher your twist rate must be,\" yet that's incorrect! It may be considered by some a technicality, but it lays an expert-level foundation for this site.\r\n\r\nI think we should take advantage of the ability to create a solid foundation of knowledge based on the small number of expert level answerers we have available to us now to lay the foundation of <strong>actual knowledge</strong> before the amateur horde arrives in open beta and starts answering questions with the commonly-accepted-but-oh-so-wrong knowledge that's been passed through the amateur gun community.\r\n\r\nThese answers are things that \"a simple Google search\" could as easily turn up an answer that is wrong as they could turn up an answer that is right just because of the level of bad info that's out there and constantly perpetuated."}
{"Id": 104, "PostHistoryTypeId": 2, "PostId": 59, "RevisionGUID": "8b144347-c051-44d7-ae85-903523ade5fb", "CreationDate": "2011-11-07T21:25:43.643", "UserId": 32, "Text": "As I commented on a question about something directly related to this: <strong>If your intent is not to kill the threat, then you should not be using a gun.</strong>\r\n\r\nIf you don't want to kill them use mace, a taser, a baseball bat, whatever. Guns in the defense are for stopping the threat, and as @dgm and @Chris Upchurch have already answered there are no better ways to stop a threat than to use lethal force. \r\n\r\nLegally, as soon as you pick up the gun your intent is the death of another party. Be in defense or offense you will be judged in that context. Why escalate your level of judgement while handicapping your level of commitment to the use of the tool?\r\n\r\nI believe that the use of guns to scare or maim is a very common and very dangerous piece of compromise that is perpetuated by the community of people who are unwilling to accept the purpose of their chosen tool. It has no place in any professional environment outside of law enforcement's use of \"Less Lethal\" rounds. <strong>Even law enforcement accepts this way of thinking by calling them \"less lethal\" as opposed to \"non-lethal.\" Less lethal rounds can kill, and have killed dozens of people.</strong>"}
{"Id": 105, "PostHistoryTypeId": 2, "PostId": 60, "RevisionGUID": "e03c4600-93b2-4cc9-9d1a-23099e3346fd", "CreationDate": "2011-11-07T21:28:57.930", "UserId": 32, "Text": "magazine-reloading (speed-loaders to quickly fill a magazine, for example)\r\n\r\nfirearm-reloading (fire the last round in a magazine, drop the magazine, load a fully filled magazine)\r\n\r\nammunition-reloading (combine the shell/brass, primer, charge, bullet/shot into a finished piece of fireable ammunition)"}
{"Id": 106, "PostHistoryTypeId": 5, "PostId": 60, "RevisionGUID": "3053c8ef-65b5-4b40-8d1e-37bb730d7da0", "CreationDate": "2011-11-07T21:35:57.670", "UserId": 32, "Comment": "added tactics", "Text": "magazine-reloading (speed-loaders to quickly fill a magazine, for example)\r\n\r\nfirearm-reloading (fire the last round in a magazine, drop the magazine, load a fully filled magazine)\r\n\r\nthis could also be broken down into the tactics of speed-firearm-reloading (reloading when you have to — malfunction or empty) and tactical-firearm-reloading (reloading when you want to — before you enter a room and you are unsure of the amount of ammo you have left but a full mag would be advantageous)\r\n\r\nammunition-reloading (combine the shell/brass, primer, charge, bullet/shot into a finished piece of fireable ammunition)"}
{"Id": 107, "PostHistoryTypeId": 5, "PostId": 60, "RevisionGUID": "829b0bc8-96ca-46e6-8f72-b385efba1b50", "CreationDate": "2011-11-08T04:08:24.210", "UserId": 32, "Comment": "tag synonym", "Text": "magazine-reloading (speed-loaders to quickly fill a magazine, for example)\r\n\r\nfirearm-reloading (fire the last round in a magazine, drop the magazine, load a fully filled magazine)\r\n\r\nthis could also be broken down into the tactics of speed-firearm-reloading (reloading when you have to — malfunction or empty) and tactical-firearm-reloading (reloading when you want to — before you enter a room and you are unsure of the amount of ammo you have left but a full mag would be advantageous)\r\n\r\nammunition-reloading (combine the shell/brass, primer, charge, bullet/shot into a finished piece of fireable ammunition)\r\n\r\nsince the most common use of the single \"reloading\" word would be what i propose as \"ammunition-reloading\" we make that a tag synonym. "}
{"Id": 108, "PostHistoryTypeId": 2, "PostId": 61, "RevisionGUID": "0fd87e11-4c80-4902-9041-de6ad9893948", "CreationDate": "2011-11-08T20:21:45.070", "UserId": 51, "Text": "Following [this discussion][1], it was determined that location dependent questions were fine. As such, I think it would be nice if questions asking about things that are location dependent be tagged for the location itself. We should not have the assumption that everybody is in the US. [Here is an example question][2] of this. It is not immediately clear what country the OP is in, unless you happen to know the laws and terms of that country.\r\n\r\nI left a comment asking the user to tag their question, but am not sure what the proper procedures should be.\r\n\r\n\r\n  [1]: http://meta.firearms.stackexchange.com/questions/15/how-should-we-deal-with-location-jurisdiction-dependent-answers\r\n  [2]: http://firearms.stackexchange.com/questions/375/how-can-i-legally-own-a-suppressor-short-barreled-rifle-machine-gun"}
{"Id": 109, "PostHistoryTypeId": 1, "PostId": 61, "RevisionGUID": "0fd87e11-4c80-4902-9041-de6ad9893948", "CreationDate": "2011-11-08T20:21:45.070", "UserId": 51, "Text": "Identifying locations in questions"}
{"Id": 110, "PostHistoryTypeId": 3, "PostId": 61, "RevisionGUID": "0fd87e11-4c80-4902-9041-de6ad9893948", "CreationDate": "2011-11-08T20:21:45.070", "UserId": 51, "Text": "<discussion>"}
{"Id": 111, "PostHistoryTypeId": 2, "PostId": 62, "RevisionGUID": "f4c32bfa-f5f2-44bf-b1e1-6a9a55fe7d78", "CreationDate": "2011-11-08T23:07:12.120", "UserId": 97, "Text": "Are links allowed when referencing an item?  I know several SE boards shy away from anything that looks like an ad.  It can be harder to link an exact item without using a store though (not everything is on wikipedia)."}
{"Id": 112, "PostHistoryTypeId": 1, "PostId": 62, "RevisionGUID": "f4c32bfa-f5f2-44bf-b1e1-6a9a55fe7d78", "CreationDate": "2011-11-08T23:07:12.120", "UserId": 97, "Text": "What about linking?"}
{"Id": 113, "PostHistoryTypeId": 3, "PostId": 62, "RevisionGUID": "f4c32bfa-f5f2-44bf-b1e1-6a9a55fe7d78", "CreationDate": "2011-11-08T23:07:12.120", "UserId": 97, "Text": "<discussion>"}
{"Id": 114, "PostHistoryTypeId": 2, "PostId": 63, "RevisionGUID": "96be962b-f2f3-4b2d-91bd-a74392967d81", "CreationDate": "2011-11-08T23:09:55.580", "UserId": 97, "Text": "Re: Birdshot... it depends on what you're using.  At the ranges you find in a home, the high brass stuff we use to kill squirrels will definitely penetrate.\r\n\r\nShould preference towards lethality be assumed?  No.  However preferenced towards \"effective\" should be assumed, and with guns more effective is virtually always going to mean more lethal."}
{"Id": 115, "PostHistoryTypeId": 2, "PostId": 64, "RevisionGUID": "c384950b-1b68-4bec-84c8-c8d2927cfe44", "CreationDate": "2011-11-08T23:11:04.360", "UserId": 79, "Text": "I don't see any problem with it.  I would probably lean towards linking to the manufacturer's website, rather than a store, if possible."}
{"Id": 119, "PostHistoryTypeId": 2, "PostId": 66, "RevisionGUID": "97c76a06-28c8-49df-8ac0-f2c499d5521e", "CreationDate": "2011-11-09T03:47:46.883", "UserId": 32, "Text": "In addition to different countries having different laws, Americans have a hard enough time tracking laws between states. I think if we had a location tag for every country, US-based questions would need a tag for every state and perhaps other countries would as well. I can see the tag pool being dominated by location tags. That seems like a bad idea.\r\n\r\n"}
{"Id": 120, "PostHistoryTypeId": 25, "PostId": 33, "RevisionGUID": "2c3e4467-fc26-4432-9324-58863069320e", "CreationDate": "2011-11-09T04:06:37.033", "Comment": "http://twitter.com/#!/StackFirearms/status/134119673783525376"}
{"Id": 121, "PostHistoryTypeId": 2, "PostId": 67, "RevisionGUID": "9cf200b5-df36-4b71-ae88-81ad095a5cf3", "CreationDate": "2011-11-09T04:06:50.197", "UserId": 32, "Text": "Today alone I have answered three questions where information needed to answer accurately was not clear. The two pieces of info I have identified as probably-required-if-you-want-an-answer important are:\r\n\r\n - Where are you located?\r\n\r\nMany legal differences exist even between states, let alone countries. The question I answered regarding the purchase of NFA firearms or suppressors is not a good example of this as it's a federal level law with differing implementations, but another question about the purchase of a 1911 for a beginner evoked comments about the ability to get a CCW in California. This info can be important in questions regarding modifications and repairs.\r\n\r\n - What is this gun's intended purpose?\r\n\r\n\"Fighting gun or range toy?\" came up multiple times today! These were questions about purchasing firearms but the same could, again, extend to questions asked about modifications, repairs, and ammunition.\r\n\r\nThere was a third piece I thought important but it has slipped my mind, maybe it wasn't important <em>enough</em>.\r\n\r\n<strong>How can we convey to our new askers that they need to provide, at a minimum, these pieces of information?</strong>\r\n\r\nCan we customize the FAQ? Can we put it in the sidebar during question creation? Can we add a header similar to the one here that says \"Take ownership of your community - Read The 7 Essential Meta Questions of Every Beta\"?\r\n\r\nAs an aside, are there any pieces of info that you believe are also vitally important to nearly any question?"}
{"Id": 122, "PostHistoryTypeId": 1, "PostId": 67, "RevisionGUID": "9cf200b5-df36-4b71-ae88-81ad095a5cf3", "CreationDate": "2011-11-09T04:06:50.197", "UserId": 32, "Text": "How do we let users know what basic information they MUST provide in questions?"}
{"Id": 123, "PostHistoryTypeId": 3, "PostId": 67, "RevisionGUID": "9cf200b5-df36-4b71-ae88-81ad095a5cf3", "CreationDate": "2011-11-09T04:06:50.197", "UserId": 32, "Text": "<discussion><feature-request><content-quality><asking-questions><new-users>"}
{"Id": 124, "PostHistoryTypeId": 2, "PostId": 68, "RevisionGUID": "791c6c76-ec5b-4322-af60-54e2d15161eb", "CreationDate": "2011-11-09T14:03:07.850", "UserId": 37, "Text": "In an answer to http://firearms.stackexchange.com/questions/387/newbie-how-to-start-with-handguns, there was the following:\r\n\r\n> We offer an incredible set of training DVDs for beginners to advanced defensive shooters. Take a look at \"Handguns 101\" at www.armedresponsetraining.com\r\n\r\nTo me, it's obviously spam and I flag it as such (what happens with those, BTW?) should it also be marked down? Do we want to encourage just flagging or just down voting or both?\r\n"}
{"Id": 125, "PostHistoryTypeId": 1, "PostId": 68, "RevisionGUID": "791c6c76-ec5b-4322-af60-54e2d15161eb", "CreationDate": "2011-11-09T14:03:07.850", "UserId": 37, "Text": "Marking down or flagging spam?"}
{"Id": 126, "PostHistoryTypeId": 3, "PostId": 68, "RevisionGUID": "791c6c76-ec5b-4322-af60-54e2d15161eb", "CreationDate": "2011-11-09T14:03:07.850", "UserId": 37, "Text": "<discussion><spam>"}
{"Id": 128, "PostHistoryTypeId": 2, "PostId": 69, "RevisionGUID": "bbed0710-ef11-450d-9369-1eb74eda4c5c", "CreationDate": "2011-11-09T14:42:54.340", "UserId": 79, "Text": "I would say we want to encourage both.  Also leave a comment on the answer in question explaining why this isn't something we want here.  I did all three on the answer you mentioned."}
{"Id": 129, "PostHistoryTypeId": 2, "PostId": 70, "RevisionGUID": "e345bbc9-1d35-4d72-9cc8-3afac2d3d53f", "CreationDate": "2011-11-09T15:58:13.400", "UserId": 37, "Text": "Nice topic.\r\n\r\nTo me, location, purpose, and as many specifics about the firearm or object of the question as possible. By that last thing, I mean: \"My old semi-auto shotgun does X when I do Y, how do I fix it?\" vs. \"I have an 1960s Browning Auto-5 shotgun that does X...\"\r\n\r\nFor some questions, make/model/year isn't going to be knowable (\"What should I look for in a used revolver?\" but the poster should be as specific as they can. The FAQ should probably point out that we want to know things like revolver vs pistol, type of action, manufacturer if known, year/era if known, etc.\r\n\r\n"}
{"Id": 130, "PostHistoryTypeId": 2, "PostId": 71, "RevisionGUID": "93288787-9649-4b2d-9b1f-af433b58b19c", "CreationDate": "2011-11-09T16:04:13.350", "UserId": 79, "Text": "I noticed that `bullet` and `bullets` are tag synonyms for `ammunition`.  This isn't really correct.  Ammunition is made up of a projectile (the bullet), the propellant (powder), primer, and a case that holds this all together.  All of these things together make up a cartridge (or for shotguns, a shell).  People do wrongly use 'bullets' when they really mean 'cartridges' or 'ammunition' but we should not be encouraging this through our tag synonyms."}
{"Id": 131, "PostHistoryTypeId": 1, "PostId": 71, "RevisionGUID": "93288787-9649-4b2d-9b1f-af433b58b19c", "CreationDate": "2011-11-09T16:04:13.350", "UserId": 79, "Text": "Ammunition tag synonyms"}
{"Id": 132, "PostHistoryTypeId": 3, "PostId": 71, "RevisionGUID": "93288787-9649-4b2d-9b1f-af433b58b19c", "CreationDate": "2011-11-09T16:04:13.350", "UserId": 79, "Text": "<discussion><tags><tag-synonyms>"}
{"Id": 133, "PostHistoryTypeId": 2, "PostId": 72, "RevisionGUID": "17d47804-3bcc-47ad-9b1d-269fa880bfdf", "CreationDate": "2011-11-09T16:55:07.403", "UserId": 37, "Text": "This is supposed to a be a site with experts, it's easy to imagine someone asking about [bullet molds][1] and actually meaning bullet, not cartridge.\r\n\r\n  [1]: http://firearms.stackexchange.com/questions/23/what-lubricants-are-most-effective-for-use-in-bullet-molds\r\n\r\nBut, does this actually matter for tags? Would a tag set of \"ammunition\", \"casting\" work just as well as \"bullet\", \"casting\"?"}
{"Id": 134, "PostHistoryTypeId": 5, "PostId": 58, "RevisionGUID": "6f4e3362-27b7-4b62-90ba-3504f587e9be", "CreationDate": "2011-11-09T23:01:26.343", "UserId": 32, "Comment": "replaced improper 'questions' with 'answers'", "Text": "I think the strength of the \"simple\" questions that we're answering here is that they may seem simple on the surface, but there is <strong>tons of misinformation</strong> that gets passed around by other non-experts. Precisely as @dgm answered, people don't know what they don't know. <strong>If we have a foundation of answers that are obviously of expert level, even to simple questions, I believe it would do more to attract experts than if we had either an unknown or known-to-be-poor level of understanding of the basics.</strong>\r\n\r\nI personally simply avoid sites where the common answer to a question about AR-15s is \"my cheap DPMS is just as good as your expensive LaRue/Bravo Company/LMT/Colt/Noveske/Daniel Defense/Knight's Armament/et al.\" because there's no point in arguing. If that community has a generally accepted answer that is wrong, it is not worth my time to come in and try to change the way the wind blows. I look for communities where, in the context of this example, quality and quality control is respected, and where the members are the kinds of people who have used these cheaper weapons, run them hard on duty and/or in training, had them fail, and \"seen the light\" on quality control for a hard use gun.\r\n\r\n<em>(That example is not an attempt to start a fight, simply an example of an expert-level opinion I have seen time and time again. It is merely an example, please take it as nothing more.)</em> \r\n\r\nThings as simple as what is the difference between a \"clip\" and a \"magazine\" may seem like a non-expert-level question, yet some self-professed \"experts\" use the term interchangeably. With this site, we have the opportunity to lay a solid foundation of \"beginner-level\" questions that dispel the myths and misinformation in an expert-level way, as well as being able to answer questions that highly knowledgeable people would consider expert-level.\r\n\r\nI'll use my answer to the \"what is twist rate\" question as an example (not to blow my own horn, but because it's front-of-mind for me): twist rate can be explained simply as \"the number of inches of barrel length required for a single revolution of the bullet.\" My answer explained (what I believe to be) an \"expert-level\" bit of knowledge in calling out that the twist rate affects bullets based on their length, and not their weight. Very few people know/realize this, in my experience. Most people just use the old \"the heavier the bullet is, the higher your twist rate must be,\" yet that's incorrect! It may be considered by some a technicality, but it lays an expert-level foundation for this site.\r\n\r\nI think we should take advantage of the ability to create a solid foundation of knowledge based on the small number of expert level answerers we have available to us now to lay the foundation of <strong>actual knowledge</strong> before the amateur horde arrives in open beta and starts answering questions with the commonly-accepted-but-oh-so-wrong knowledge that's been passed through the amateur gun community.\r\n\r\nThese answers are things that \"a simple Google search\" could as easily turn up an answer that is wrong as they could turn up an answer that is right just because of the level of bad info that's out there and constantly perpetuated."}
{"Id": 135, "PostHistoryTypeId": 2, "PostId": 73, "RevisionGUID": "21e9b88e-12c0-4e42-8238-8dec7c4853d9", "CreationDate": "2011-11-09T23:06:48.240", "UserId": 32, "Text": "I broke a tag while editing a post, and ended up with a tag called 'rangeammunition-reloading' instead of simply using 'ammunition-reloading'. The way that it makes tags a single object to be edited rather than simply a space-delimited list bit me. \r\n\r\nI have re-edited the tag but see no provision in the tags screen or info for deleting this tag. \r\n\r\nwill it auto-delete when no questions use it? or does a mod have to do this manually?"}
{"Id": 136, "PostHistoryTypeId": 1, "PostId": 73, "RevisionGUID": "21e9b88e-12c0-4e42-8238-8dec7c4853d9", "CreationDate": "2011-11-09T23:06:48.240", "UserId": 32, "Text": "is there a provision for deleting tags?"}
{"Id": 137, "PostHistoryTypeId": 3, "PostId": 73, "RevisionGUID": "21e9b88e-12c0-4e42-8238-8dec7c4853d9", "CreationDate": "2011-11-09T23:06:48.240", "UserId": 32, "Text": "<support><tags>"}
{"Id": 138, "PostHistoryTypeId": 2, "PostId": 74, "RevisionGUID": "5528dc50-b641-4acd-9411-9d26c4f10c64", "CreationDate": "2011-11-09T23:12:57.873", "UserId": 32, "Text": "I've gone through a bunch of Qs/As and attempted to make questions more readable and specific, as well as fixing grammar and spelling mistakes I come across. I continuously run across a user who, upon having his questions, answers, or titles edited will either rollback the edits, or if they have merit roll them back and re-edit it themselves, often in a distinctly different way than mine.\r\n\r\nIn the process of doing this, this user has occasionally done a re-edit that is no longer incorrect for the reasons I edited them originally but is now incorrect for a new reason, or has simply reworded an edit I have made and now the question may be correct but is needlessly long or wordy, or possibly ambiguous. \r\n\r\nHow are users who refuse to accept edits to be dealt with? Is it solely the moderator's job? I originally flagged one of these for moderator attention, and stated that I disagreed with the rollback of my edit in the comment box. Nothing came of this, and after a few days of it still being incorrect I re-edited it, and the cycle began again."}
{"Id": 139, "PostHistoryTypeId": 1, "PostId": 74, "RevisionGUID": "5528dc50-b641-4acd-9411-9d26c4f10c64", "CreationDate": "2011-11-09T23:12:57.873", "UserId": 32, "Text": "How do we handle users who refuse to allow editing of their Qs or As?"}
{"Id": 140, "PostHistoryTypeId": 3, "PostId": 74, "RevisionGUID": "5528dc50-b641-4acd-9411-9d26c4f10c64", "CreationDate": "2011-11-09T23:12:57.873", "UserId": 32, "Text": "<discussion><editing><users>"}
{"Id": 141, "PostHistoryTypeId": 2, "PostId": 75, "RevisionGUID": "01eef4c7-dc82-43e8-9bd1-a3661fe99714", "CreationDate": "2011-11-09T23:32:36.583", "UserId": 79, "Text": "A tag that is not used by any question will be auto-deleted after one day IIRC."}
{"Id": 142, "PostHistoryTypeId": 2, "PostId": 76, "RevisionGUID": "23f2a90b-0397-49a0-aa5a-50778ed4f735", "CreationDate": "2011-11-09T23:35:42.850", "UserId": 79, "Text": "Well, in the FAQ it says, \"If you are not comfortable with the idea of your contributions being collaboratively edited by other trusted users, this may not be the site for you.\"\r\n\r\nMy take, as long as the question is incorrect or unclear, don't hesitate to edit it (again if necessary).  "}
{"Id": 143, "PostHistoryTypeId": 2, "PostId": 77, "RevisionGUID": "e26af8dc-e5cd-4a2c-9a8a-14b7d0737b00", "CreationDate": "2011-11-10T00:41:39.520", "UserId": 37, "Text": "I suspect I know the result of this, but how about adding a comment to the answer you edited indicating what the intent of your edit was? If it's rolled-back, then add a comment asking why? \r\n\r\nI'm trying to engage the other person, but I suspect that if it was that easy, the cycle wouldn't have started in the first place.\r\n\r\n*On second thought, I'm just going to follow Bryson around and edit his edits ever so slightly. ;-)*"}
{"Id": 144, "PostHistoryTypeId": 2, "PostId": 78, "RevisionGUID": "8596899a-1fe0-4754-bb54-ac668c17130e", "CreationDate": "2011-11-10T01:41:31.183", "UserId": 32, "Text": "I have edited the posts under the tag \"reloading\" to the new tag \"ammunition-reloading\". This tag was created during my first edit of a user's question. \r\n\r\nThere are badges regarding popular tags, so that got me wondering if I stole a badge from the first reloading question asker, or if the person who's question I edited when I created the tag stole the badge (assuming he wasn't the first reloading question asker)..."}
{"Id": 145, "PostHistoryTypeId": 1, "PostId": 78, "RevisionGUID": "8596899a-1fe0-4754-bb54-ac668c17130e", "CreationDate": "2011-11-10T01:41:31.183", "UserId": 32, "Text": "If I create a new tag while editing a user's question, who created the tag?"}
{"Id": 146, "PostHistoryTypeId": 3, "PostId": 78, "RevisionGUID": "8596899a-1fe0-4754-bb54-ac668c17130e", "CreationDate": "2011-11-10T01:41:31.183", "UserId": 32, "Text": "<support><tags>"}
{"Id": 147, "PostHistoryTypeId": 2, "PostId": 79, "RevisionGUID": "bd5e71fd-b7c5-4b05-b31c-62412920e7bb", "CreationDate": "2011-11-10T09:07:52.930", "UserId": 125, "Text": "You could shoot them in the knee, have them be unfazed (not uncommon when adrenalin or drugs are present), disarm, and kill you or your family.\r\n\r\n...or...\r\n\r\nYou could kill them and not risk it.\r\n\r\nRegardless, if you find yourself in a situation where you feel you must defend yourself with a device that is inherently lethal, then lethal force must be used, otherwise that force can and probably will be used against you.\r\n\r\nIn fact, I've heard (totally unconfirmed, but revealed to me by someone I consider an expert) that if you pull a weapon on someone, that person has a legal right to kill you (in the US).\r\n\r\nUsing anything less than lethal would be stupid.\r\n\r\n---\r\n\r\nAs for your question, the validation of the necessity (or not) of lethality in self defense can be answered like any other question on this site.\r\n\r\n- Q: \"Shoot to kill or shoot to wound?\"\r\n\r\n- Q: \"Does using a firearm for self defense imply the need for lethality?\"\r\n\r\n- etc...\r\n\r\nI believe these are all valid questions in the SE system as they can be answered by self-defense professionals."}
{"Id": 148, "PostHistoryTypeId": 2, "PostId": 80, "RevisionGUID": "838b2dba-606e-481a-b8e8-458256cf9e67", "CreationDate": "2011-11-10T21:54:38.557", "UserId": 10, "Text": "Don't feel bad about editing if they add value. Also keep on flagging _valid_ rollback complaints. Flags are tracked per user, so this will build up a history mods can look at. Also if you think it's really bad, you can email `team+firearms@stackexchange.com` "}
{"Id": 149, "PostHistoryTypeId": 2, "PostId": 81, "RevisionGUID": "6b170a7d-dd49-47cd-bb99-2119367a471f", "CreationDate": "2011-11-12T20:41:53.003", "UserId": 236, "Text": "While this is a site for experts, like other stack exchange sites I imagine it will be a popular Google destinations for many novices. As a result I would argue that the tags should be watched carefully by the community for accuracy. As indicated in the question, a bullet on its own is not ammunition and a round of ammunition is much more thank bullet. The tags should reflect that."}
{"Id": 150, "PostHistoryTypeId": 16, "PostId": 81, "RevisionGUID": "358acd10-93e0-4dbb-853c-6deef156ece6", "CreationDate": "2011-11-12T20:41:53.003", "UserId": 236}
{"Id": 151, "PostHistoryTypeId": 2, "PostId": 82, "RevisionGUID": "c22f7fab-958a-4810-b810-11f817215e08", "CreationDate": "2011-11-14T15:50:54.443", "UserId": 187, "Text": "I have asked a question and it appears that it would do better as a community wiki. How do I go about changing it's type?"}
{"Id": 152, "PostHistoryTypeId": 1, "PostId": 82, "RevisionGUID": "c22f7fab-958a-4810-b810-11f817215e08", "CreationDate": "2011-11-14T15:50:54.443", "UserId": 187, "Text": "How do I turn a question into a community wiki?"}
{"Id": 153, "PostHistoryTypeId": 3, "PostId": 82, "RevisionGUID": "c22f7fab-958a-4810-b810-11f817215e08", "CreationDate": "2011-11-14T15:50:54.443", "UserId": 187, "Text": "<support>"}
{"Id": 155, "PostHistoryTypeId": 2, "PostId": 83, "RevisionGUID": "d3224bb0-672d-4cc8-b237-a4a9867e48a5", "CreationDate": "2011-11-15T21:18:58.243", "UserId": 95, "Text": "Questions can no longer be made Community Wiki. The feature was far too misused and abused to be left in its current form. Community Wiki posts are becoming increasingly rare. See \r\n\r\n[**The Future of Community Wiki**](http://blog.stackoverflow.com/2011/08/the-future-of-community-wiki/)\r\n\r\nIf you truly feel a questions should be made Community Wiki, you can flag it for moderator attention. But be advised that most wiki requests are often viewed as *\"should this question be on this system at all.\"* It is usually better to either forgo the question or make it much more specific and answerable so it doesn't *have* to be made wiki."}
{"Id": 158, "PostHistoryTypeId": 2, "PostId": 84, "RevisionGUID": "51910b41-6f1c-4d2f-8caa-ec030b9ed522", "CreationDate": "2011-11-19T02:17:08.027", "UserDisplayName": "user116", "Text": "A general principle of professional editing is to be careful not to change the original intent of the author. There are several \"editors\" on this SE site that use editing to change the original intent of questions and answers, to fit what they think is a better question or answer, sometimes without actually thinking about what the original intent was. In one case, the editor had to admit that he hadn't carefully read what he had changed. \r\n\r\nThe inclusion of a \"rollback\" feature is important because through the judicious use of the rollback, the original questioner or answerer can learn to improve the writing. When you edit a question to change the meaning, you are inserting your thoughts and this may not be what the author wanted to know. Seems to me that just because an author rewords something in response to your editing, it shouldn't be taken as an insult but as a positive thing. Your editing has educated the original writer. It is hard to avoid letting the power of changing the words of someone else become an exercise in controlling speech and inhibiting free discussion."}
{"Id": 159, "PostHistoryTypeId": 2, "PostId": 85, "RevisionGUID": "b6fcc11d-f80f-4ac4-b895-106673c66181", "CreationDate": "2011-11-20T04:12:20.730", "UserId": 48, "Text": "The person who directly causes the tag to be created is considered to have created the tag.\r\n\r\nSo whether you introduce a new tag to the site by posting a question with that tag on it, or by editing it into someone else's post, *you* created that tag. This is tracked independently of the actual posts the tag is on, so if the tag is later removed from the post on which it was introduced, the \"creator\" stays the same (with the exception of a tag that is removed from *all* posts and then automatically deleted by the system - at this point, it'll effectively be created anew upon its next use)."}
{"Id": 160, "PostHistoryTypeId": 2, "PostId": 86, "RevisionGUID": "8f2e18bb-ea57-4cb1-b95b-f01ff4690bcb", "CreationDate": "2011-11-23T19:16:46.433", "UserId": 166, "Text": "To clear up any misunderstandings and to keep the topics consistent, I suggest that the exchange adopt the existing definitions of firearms that are already codified in the USC.  While some states and political subdivisions may further define other items like pellet guns, airsoft, slingshots, etc as weapons, it is too local to be consistent with Q&A.  As an example, one state in mind has criminal statutes and environmental statutes that conflict with respect to defining what is a “pistol.”\r\n\r\nWith a consistent definition of firearms (Title I and Title II), the exchange will avoid the circumstances of providing legal advice as discussed in a previous question in this meta.  Having the exchange define “firearms” in too broad a sense will result in diluting the content shared.  Generally speaking, many people do not consider other devices firearms unless they propel a projectile by way of an explosive propellant, no matter how a few states may define other projectile weapons. "}
{"Id": 161, "PostHistoryTypeId": 2, "PostId": 87, "RevisionGUID": "6ae6154d-67f5-407a-a5cb-70bece29af1d", "CreationDate": "2011-11-27T04:10:56.457", "UserId": 121, "Text": "On Gaming.StackExchange (where I spend most of my time), Super User, and most of the other StackExchanges, **shopping recommendations are considered off-topic**.  The [Super User Meta sums it up:][1]\r\n\r\n> As discussed several times, shopping questions are off-topic on Super\r\n> User.\r\n> \r\n> They are too specific, related to a particular time, a particular\r\n> place, and are also open to subjectivity (advising \"which is best\" is\r\n> likely to gather mostly personal opinions).\r\n\r\n[This question][2] is our first example of a shopping recommendation.  The question:\r\n\r\n - Has no specific, objective answer\r\n - Asks which firearms are \"better\" but provides no criteria for comparison (other than price)\r\n - Outright requests a shopping list\r\n\r\n**Should this question, and questions like these, be closed as off-topic?**\r\n\r\n  [1]: http://meta.superuser.com/questions/1103/should-we-add-a-no-shopping-recommendation-clause-to-the-super-user-faq\r\n  [2]: http://firearms.stackexchange.com/questions/577/which-other-handguns-are-comparable-to-the-glock-22-40-sw"}
{"Id": 162, "PostHistoryTypeId": 1, "PostId": 87, "RevisionGUID": "6ae6154d-67f5-407a-a5cb-70bece29af1d", "CreationDate": "2011-11-27T04:10:56.457", "UserId": 121, "Text": "Should shopping recommendations be considered off-topic on Firearms?"}
{"Id": 163, "PostHistoryTypeId": 3, "PostId": 87, "RevisionGUID": "6ae6154d-67f5-407a-a5cb-70bece29af1d", "CreationDate": "2011-11-27T04:10:56.457", "UserId": 121, "Text": "<discussion>"}
{"Id": 164, "PostHistoryTypeId": 5, "PostId": 87, "RevisionGUID": "f6d3c92a-2067-4d96-be3d-2db3f454cbc1", "CreationDate": "2011-11-27T04:16:27.880", "UserId": 121, "Comment": "More from our own meta", "Text": "On Gaming.StackExchange (where I spend most of my time), Super User, and most of the other StackExchanges, **shopping recommendations are considered off-topic**.  The [Super User Meta sums it up:][1]\r\n\r\n> As discussed several times, shopping questions are off-topic on Super\r\n> User.\r\n> \r\n> They are too specific, related to a particular time, a particular\r\n> place, and are also open to subjectivity (advising \"which is best\" is\r\n> likely to gather mostly personal opinions).\r\n\r\nAnd also, [from an answer on our own meta][2]:\r\n\r\n> When you sit down to ask a question, try to focus on the concrete\r\n> results you want from getting the one correct answer. If there's no\r\n> one correct answer, or there's no result once you have that answer,\r\n> it's probably a bad question.\r\n\r\n\r\n[This question][3] is our first example of a shopping recommendation.  The question:\r\n\r\n - Has no specific, objective answer\r\n - Asks which firearms are \"better\" but provides no criteria for comparison (other than price)\r\n - Outright requests a shopping list\r\n\r\n**Should this question, and questions like these, be closed as off-topic?**\r\n\r\n\r\n  [1]: http://meta.superuser.com/questions/1103/should-we-add-a-no-shopping-recommendation-clause-to-the-super-user-faq\r\n  [2]: http://meta.firearms.stackexchange.com/q/42/121\r\n  [3]: http://firearms.stackexchange.com/questions/577/which-other-handguns-are-comparable-to-the-glock-22-40-sw"}
{"Id": 165, "PostHistoryTypeId": 2, "PostId": 88, "RevisionGUID": "075df7e4-bf69-4271-8fc1-5c67dfdbd2a4", "CreationDate": "2011-11-28T11:19:53.033", "UserId": 32, "Text": "I have come up with, in the past couple days, a couple shopping questions of my own that I'd like to ask. An example would be this:\r\n\r\n> Where can I buy a custom leather holster for <em>x firearm</em>? I\r\n> know of the following custom leather holster makers, but none of them\r\n> have a mold for <em>x firearm</em> and I prefer hand-made leather to\r\n> mass-produced leather or kydex.\r\n> \r\n>  - Maker A to be excluded\r\n>  - Maker B to be excluded\r\n>  - Maker C to be excluded\r\n> \r\n> I'm not concerned with waiting periods or price. Just need names of good makers, preferably already known to have the mold for <em>x firearm</em>.\r\n\r\nI came to the Meta tonight to ask about posting this specific question. \r\n\r\n<strong>I believe that they would be on-topic.</strong> Granted, I also believe that a question like mine would be a good candidate for a community wiki but those are also in the no-zone these days. So maybe I'm wrong.\r\n\r\nIt's questions like these that are very valuable I believe. Is this a shopping question? Yes, but it's very specific. I really do have a gun that I can't find holster makers for: a SIG P220 Compact with a beaver-tail elite frame, single action only, and no light rail on the dust cover. Apparently the only molds that exist are P220 Compacts with decockers and light rails. So while technically yes this question is a shopping question there is also a definite answer. Or rather, a possible list of definite answers which can be updated in the future as leather makers open and close (community wiki). It is also a specific question that has nothing to do with opinion.\r\n\r\n<strong>Much care must be taken with these, and they must be aggressively flagged when too general.</strong> But if the questions are specific, as I believe my example to be, I think they definitely have their place. Especially in the world of firearms, where a lot happens by word of mouth — us gun enthusiasts aren't all the best with computers and Google doesn't work for shopping anymore with all the SEO games people play. "}
{"Id": 166, "PostHistoryTypeId": 2, "PostId": 89, "RevisionGUID": "ea861e46-174a-44ec-b406-35d4a2dc241c", "CreationDate": "2011-11-28T11:26:04.553", "UserId": 32, "Text": "I have a few questions about gear. Specifically, holsters for concealed carry and tactical nylon gear for use in the military. \r\n\r\nI believe that these are definitely firearm related, easily as much as, say, a gun safe might be. A tactical nylon pouch would be no more removed from firearms than spare magazine carriers for a concealed carry application: both are simply a reserve of ammunition for your firearm.\r\n\r\nI believe that the supporting gear items should be included as well as a primary focus on proper firearms."}
{"Id": 167, "PostHistoryTypeId": 1, "PostId": 89, "RevisionGUID": "ea861e46-174a-44ec-b406-35d4a2dc241c", "CreationDate": "2011-11-28T11:26:04.553", "UserId": 32, "Text": "How far into the world of \"gear\" should questions be allowed to go?"}
{"Id": 168, "PostHistoryTypeId": 3, "PostId": 89, "RevisionGUID": "ea861e46-174a-44ec-b406-35d4a2dc241c", "CreationDate": "2011-11-28T11:26:04.553", "UserId": 32, "Text": "<discussion>"}
{"Id": 169, "PostHistoryTypeId": 5, "PostId": 88, "RevisionGUID": "a09c7b94-af8b-4c94-8f8d-3ebc6ee35f76", "CreationDate": "2011-11-28T11:26:42.257", "UserId": 32, "Comment": "caveats!", "Text": "I have come up with, in the past couple days, a couple shopping questions of my own that I'd like to ask. An example would be this:\r\n\r\n> Where can I buy a custom leather holster for <em>x firearm</em>? I\r\n> know of the following custom leather holster makers, but none of them\r\n> have a mold for <em>x firearm</em> and I prefer hand-made leather to\r\n> mass-produced leather or kydex.\r\n> \r\n>  - Maker A to be excluded\r\n>  - Maker B to be excluded\r\n>  - Maker C to be excluded\r\n> \r\n> I'm not concerned with waiting periods or price. Just need names of good makers, preferably already known to have the mold for <em>x firearm</em>.\r\n\r\nI came to the Meta tonight to ask about posting this specific question. \r\n\r\n<strong>I believe that, as long as not overly broad or subjective, they would be on-topic.</strong> Granted, I also believe that a question like mine would be a good candidate for a community wiki but those are also in the no-zone these days. So maybe I'm wrong.\r\n\r\nIt's questions like these that are very valuable I believe. Is this a shopping question? Yes, but it's very specific. I really do have a gun that I can't find holster makers for: a SIG P220 Compact with a beaver-tail elite frame, single action only, and no light rail on the dust cover. Apparently the only molds that exist are P220 Compacts with decockers and light rails. So while technically yes this question is a shopping question there is also a definite answer. Or rather, a possible list of definite answers which can be updated in the future as leather makers open and close (community wiki). It is also a specific question that has nothing to do with opinion.\r\n\r\n<strong>Much care must be taken with these, and they must be aggressively flagged when too general.</strong> But if the questions are specific, as I believe my example to be, I think they definitely have their place. Especially in the world of firearms, where a lot happens by word of mouth — us gun enthusiasts aren't all the best with computers and Google doesn't work for shopping anymore with all the SEO games people play. "}
{"Id": 170, "PostHistoryTypeId": 5, "PostId": 67, "RevisionGUID": "7193ca9f-40fe-4add-93f0-deb8b9698099", "CreationDate": "2011-11-28T11:28:57.060", "UserId": 32, "Comment": "public beta annoying users", "Text": "Today alone I have answered three questions where information needed to answer accurately was not clear. The two pieces of info I have identified as probably-required-if-you-want-an-answer important are:\r\n\r\n - Where are you located?\r\n\r\nMany legal differences exist even between states, let alone countries. The question I answered regarding the purchase of NFA firearms or suppressors is not a good example of this as it's a federal level law with differing implementations, but another question about the purchase of a 1911 for a beginner evoked comments about the ability to get a CCW in California. This info can be important in questions regarding modifications and repairs.\r\n\r\n - What is this gun's intended purpose?\r\n\r\n\"Fighting gun or range toy?\" came up multiple times today! These were questions about purchasing firearms but the same could, again, extend to questions asked about modifications, repairs, and ammunition.\r\n\r\nThere was a third piece I thought important but it has slipped my mind, maybe it wasn't important <em>enough</em>.\r\n\r\n<strong>How can we convey to our new askers that they need to provide, at a minimum, these pieces of information?</strong>\r\n\r\nCan we customize the FAQ? Can we put it in the sidebar during question creation? Can we add a header similar to the one here that says \"Take ownership of your community - Read The 7 Essential Meta Questions of Every Beta\"?\r\n\r\nAs an aside, are there any pieces of info that you believe are also vitally important to nearly any question?\r\n\r\nI continue to see low-reputation users (new public-beta users just finding the site, most likely) asking one line questions without providing even the minimum of what they want to use a gun for. Essentially asking for a compare-and-contrast essay of all their available options."}
{"Id": 171, "PostHistoryTypeId": 2, "PostId": 90, "RevisionGUID": "0dee6e66-3ad2-415c-9aae-d858637fbf94", "CreationDate": "2011-12-01T02:35:24.073", "UserId": 95, "Text": "We work hard to keep sites from falling into the tired, lazy \"what should I buy...\" forums. Any question where users can just pile in their favorite brands choices is a really bad fit for this site. \r\n\r\n[**Q&A is Hard, Let's Go Shopping!**](http://blog.stackoverflow.com/2010/11/qa-is-hard-lets-go-shopping/)\r\n\r\nThe [Super User post](http://meta.superuser.com/questions/1103/should-we-add-a-no-shopping-recommendation-clause-to-the-super-user-faq) you linked above pretty much sums it up. Once you open up to reviews and buying recommendations, the Q&A appeal of this site becomes boring really fast. \r\n\r\nNow, if you have a particularly interesting (and specific) *consumer* problem that would just intrigue any gun expert, all we ask is that you put a fair share of effort and research into the question. Make it interesting; not lazy."}
{"Id": 172, "PostHistoryTypeId": 2, "PostId": 91, "RevisionGUID": "64a3a12d-0b30-4015-95ba-3d681d5b8a5c", "CreationDate": "2011-12-01T02:44:19.123", "UserId": 95, "Text": "Holsters, concealment, tactical and other supporting gear are an integral part of firearm expertise. \r\n\r\nI see no problem with them being explicitly on topic for this site."}
{"Id": 173, "PostHistoryTypeId": 2, "PostId": 92, "RevisionGUID": "33e37236-f58c-4a25-93ae-ead62886db3b", "CreationDate": "2011-12-01T16:56:12.197", "UserId": 78, "Text": "I agree. Gear is integral to the experience of firearms ownership. Yes, questions about that should be allowed. The community will eventually find the \"edge\" of what is of value in this regard. E.g. Something like \"What do I need to know when selecting a concealed carry holster?\" is an obviously valuable question. "}
{"Id": 174, "PostHistoryTypeId": 2, "PostId": 93, "RevisionGUID": "3f42ec51-83da-43dd-85d1-6b0d429270cc", "CreationDate": "2011-12-05T01:10:16.790", "UserId": 278, "Text": "Throughout the beta, we need members from the site whose focus is to engage the community, both in community-building issues and site management. That's why we select a few members from each community to act as temporary, provisional Moderators. You can read about the program here: [**Moderators Pro Tempore**](http://blog.stackoverflow.com/2010/07/moderator-pro-tempore/).\r\n\r\nI am pleased to announce that these members have stepped up and generously volunteered their time to help us assure that each community’s issues are properly addressed.\r\n\r\n[![kbyrd][1]][2]\r\n[![dgm][3]][4]\r\n[![OldWolf][5]][6]\r\n\r\n\r\nWe want to make this site a huge success, and these members are great examples of exactly the type of people we need to make this site succeed. Please welcome them for the hard work and time they contribute.\r\n\r\n###Did I overlook anyone? \r\nAlmost certainly. There are members who are actively involved and very deserving of recognition. My failure to account for everyone this early on is in *no way* a slight against them. Ideally, Moderators are elected by the community and that's why **you'll have your elections once your site has graduated.**  \r\n\r\nMost of all, be respectful and understanding of the Moderators Pro Tem. Members of your community are volunteering their time and learning on the job. It’s a learning experience for everyone. \r\n\r\n\r\n<!-- kbyrd -->\r\n  [1]: http://firearms.stackexchange.com/users/flair/37.png?theme=clean\r\n  [2]: http://firearms.stackexchange.com/users/37/kbyrd\r\n  \r\n<!-- dgm -->\r\n  [3]: http://firearms.stackexchange.com/users/flair/78.png?theme=clean\r\n  [4]: http://firearms.stackexchange.com/users/78/dgm\r\n\r\n<!-- OldWolf -->\r\n  [5]: http://firearms.stackexchange.com/users/flair/111.png?theme=clean\r\n  [6]: http://firearms.stackexchange.com/users/111/oldwolf"}
{"Id": 175, "PostHistoryTypeId": 1, "PostId": 93, "RevisionGUID": "3f42ec51-83da-43dd-85d1-6b0d429270cc", "CreationDate": "2011-12-05T01:10:16.790", "UserId": 278, "Text": "Moderator Pro-Tem Announcement"}
{"Id": 176, "PostHistoryTypeId": 3, "PostId": 93, "RevisionGUID": "3f42ec51-83da-43dd-85d1-6b0d429270cc", "CreationDate": "2011-12-05T01:10:16.790", "UserId": 278, "Text": "<discussion><featured><moderators>"}
{"Id": 177, "PostHistoryTypeId": 25, "PostId": 93, "RevisionGUID": "19604acd-fcfb-4d8b-a344-93adbeea995a", "CreationDate": "2011-12-05T04:09:11.303", "Comment": "http://twitter.com/#!/StackFirearms/status/143542407546408961"}
{"Id": 178, "PostHistoryTypeId": 2, "PostId": 94, "RevisionGUID": "255e707a-ac04-40ef-8151-f8f3d272b890", "CreationDate": "2011-12-05T13:48:16.123", "UserId": 78, "Text": "I have some moderator & admin experience from other forums that I've personally operated as well as ones run by others. I'm happy to help out here."}
{"Id": 179, "PostHistoryTypeId": 5, "PostId": 93, "RevisionGUID": "be00bcea-6c25-4a83-9ba5-7f9b1ef3df65", "CreationDate": "2011-12-06T03:58:36.117", "UserId": 278, "Comment": "deleted 36 characters in body", "Text": "Throughout the beta, we need members from the site whose focus is to engage the community, both in community-building issues and site management. That's why we select a few members from each community to act as temporary, provisional Moderators. You can read about the program here: [**Moderators Pro Tempore**](http://blog.stackoverflow.com/2010/07/moderator-pro-tempore/).\r\n\r\nI am pleased to announce that these members have stepped up and generously volunteered their time to help us assure that each community’s issues are properly addressed.\r\n\r\n[![kbyrd][1]][2]\r\n[![dgm][3]][4]\r\n[![OldWolf][5]][6]\r\n\r\n\r\nWe want to make this site a huge success, and these members are great examples of exactly the type of people we need to make this site succeed. Please welcome them for the hard work and time they contribute.\r\n\r\n###Did I overlook anyone? \r\nAlmost certainly. There are members who are actively involved and very deserving of recognition. My failure to account for everyone this early on is in *no way* a slight against them. Ideally, Moderators are elected by the community and that's why **you'll have your elections once your site has graduated.**  \r\n\r\nMost of all, be respectful and understanding of the Moderators Pro Tem. Members of your community are volunteering their time and learning on the job. It’s a learning experience for everyone. \r\n\r\n\r\n<!-- kbyrd -->\r\n  [1]: http://firearms.stackexchange.com/users/flair/37.png\r\n  [2]: http://firearms.stackexchange.com/users/37/kbyrd\r\n  \r\n<!-- dgm -->\r\n  [3]: http://firearms.stackexchange.com/users/flair/78.png\r\n  [4]: http://firearms.stackexchange.com/users/78/dgm\r\n\r\n<!-- OldWolf -->\r\n  [5]: http://firearms.stackexchange.com/users/flair/111.png\r\n  [6]: http://firearms.stackexchange.com/users/111/oldwolf"}
{"Id": 180, "PostHistoryTypeId": 6, "PostId": 2, "RevisionGUID": "54e3f36a-aa8f-4301-a8fd-ac1f5f85c1bb", "CreationDate": "2011-12-07T19:29:53.157", "UserId": 163, "Comment": "edited tags", "Text": "<discussion><scope>"}
{"Id": 181, "PostHistoryTypeId": 6, "PostId": 87, "RevisionGUID": "8d704642-c226-4f31-82af-65c76273ce1f", "CreationDate": "2011-12-07T19:33:30.483", "UserId": 163, "Comment": "edited tags", "Text": "<discussion><scope>"}
{"Id": 182, "PostHistoryTypeId": 6, "PostId": 89, "RevisionGUID": "7f133c31-757d-4b65-8175-fa45674afbdc", "CreationDate": "2011-12-07T19:33:38.923", "UserId": 163, "Comment": "edited tags", "Text": "<discussion><scope>"}
{"Id": 183, "PostHistoryTypeId": 6, "PostId": 1, "RevisionGUID": "85daa4d9-2735-4828-b885-2188955ffc63", "CreationDate": "2011-12-07T19:34:54.920", "UserId": 163, "Comment": "edited tags", "Text": "<discussion><scope>"}
{"Id": 184, "PostHistoryTypeId": 2, "PostId": 95, "RevisionGUID": "902babb4-523f-4884-8c45-003f86df7218", "CreationDate": "2011-12-07T19:59:11.987", "UserId": 163, "Text": "For comparison, here's some shopping-*related* questions which I think are just fine:\r\n\r\n* [Left handed, semi-auto shotguns besides Benelli?](http://firearms.stackexchange.com/questions/722/left-handed-semi-auto-shotguns-besides-benelli)\r\n* [Unique features of over/under shotguns](http://firearms.stackexchange.com/questions/620/unique-features-of-over-under-shotguns)\r\n* [Which sights are better for bifocal wearers?](http://firearms.stackexchange.com/questions/420/which-sights-are-better-for-bifocal-wearers)\r\n\r\nThis one is borderline--it's fairly broad and somewhat subjective and I'd lean towards closing:\r\n\r\n* http://firearms.stackexchange.com/questions/577/which-other-handguns-are-comparable-to-the-glock-22-40-sw"}
{"Id": 185, "PostHistoryTypeId": 6, "PostId": 15, "RevisionGUID": "65f16169-9a55-45ce-af48-637888b38f50", "CreationDate": "2011-12-07T20:04:20.587", "UserId": 163, "Comment": "edited tags", "Text": "<discussion><scope><balkanization>"}
{"Id": 186, "PostHistoryTypeId": 2, "PostId": 96, "RevisionGUID": "7e96299f-7a46-49af-b4a8-de6a7491cba4", "CreationDate": "2011-12-07T20:18:12.790", "UserId": 163, "Text": "Based on experience on other SE sites, all the banners and click-throughs in the world won't stop bad questions. A good FAQ will help a little, but the main thing is to set a good example by keeping the site's standards high. Close bad questions quickly if they're hopeless (and reopen if they're improved), or edit them into something better.\r\n\r\nEven if you have to edit it so much that the question may no longer be what the original poster was asking, it will be better than a closed, dead question, and may be useful to others. I'd probably only do this after leaving a comment giving the poster a little time to improve it, and only if there weren't lots of other questions covering the same ground."}
{"Id": 187, "PostHistoryTypeId": 2, "PostId": 97, "RevisionGUID": "426f245b-c781-4d13-89e5-728bfff005c2", "CreationDate": "2011-12-08T20:32:26.097", "UserId": 37, "Text": "http://firearms.stackexchange.com/questions/692/how-can-i-modify-the-bullet-trajectory-based-on-the-ballistic-coefficient\r\n\r\nI get why the poster put it both here and in the Physics SE. Given the better answers there, I'm inclined to close this one.\r\n"}
{"Id": 188, "PostHistoryTypeId": 1, "PostId": 97, "RevisionGUID": "426f245b-c781-4d13-89e5-728bfff005c2", "CreationDate": "2011-12-08T20:32:26.097", "UserId": 37, "Text": "What should we do with a double posted question?"}
{"Id": 189, "PostHistoryTypeId": 3, "PostId": 97, "RevisionGUID": "426f245b-c781-4d13-89e5-728bfff005c2", "CreationDate": "2011-12-08T20:32:26.097", "UserId": 37, "Text": "<discussion>"}
{"Id": 190, "PostHistoryTypeId": 2, "PostId": 98, "RevisionGUID": "c73403f3-e144-4a55-be1f-4e38f32d0698", "CreationDate": "2011-12-08T21:37:10.900", "UserId": 78, "Text": "I tend to agree. This isn't really a firearms question; it's a generic ballistics question. The accepted answer here just references the answer in the physics forum."}
{"Id": 191, "PostHistoryTypeId": 2, "PostId": 99, "RevisionGUID": "34ab8ff6-420d-43b6-971e-897b2d05023b", "CreationDate": "2011-12-09T16:38:40.600", "UserId": 111, "Text": "I have a \"suggested excerpt\" of \"a handgun where the chamber rotates\" but that seems a little weak and the tag isn't fleshed out after that. Should I reject the suggestion? Does anyone have a suggested improvement? As an aside, a number of our tags could use a definition and or improvement if anyone's feeling ambitious."}
{"Id": 192, "PostHistoryTypeId": 1, "PostId": 99, "RevisionGUID": "34ab8ff6-420d-43b6-971e-897b2d05023b", "CreationDate": "2011-12-09T16:38:40.600", "UserId": 111, "Text": "How should we define the tag \"revolver\"?"}
{"Id": 193, "PostHistoryTypeId": 3, "PostId": 99, "RevisionGUID": "34ab8ff6-420d-43b6-971e-897b2d05023b", "CreationDate": "2011-12-09T16:38:40.600", "UserId": 111, "Text": "<discussion><revolver>"}
{"Id": 194, "PostHistoryTypeId": 2, "PostId": 100, "RevisionGUID": "666b3aa1-79b6-4f65-a4fb-9083b2808888", "CreationDate": "2011-12-09T20:04:59.927", "UserId": 78, "Text": "What's wrong with using a standard dictionary definition?\r\n\r\nhttp://www.merriam-webster.com/dictionary/revolver\r\n\r\n\r\n2. a handgun with a cylinder of several chambers brought successively into line with the barrel and discharged with the same hammer"}
{"Id": 195, "PostHistoryTypeId": 2, "PostId": 101, "RevisionGUID": "e91fb2e1-6547-455c-9809-46367f9c0798", "CreationDate": "2011-12-09T20:10:20.623", "UserId": 163, "Text": "If there's currently *no* excerpt, then that's the standard I'd use when judging the suggestion: \"Is it better than nothing?\". They're editable by anyone so that they can be steadily improved, they don't have to be brilliant and comprehensive right off the bat.\r\n\r\nDGM's definition works for me, but perhaps \"handgun\" should be broadened to \"firearm\":\r\n\r\n![Circuit Judge][1]\r\n\r\n\r\n  [1]: http://i.stack.imgur.com/3BpfQ.jpg"}
{"Id": 196, "PostHistoryTypeId": 2, "PostId": 102, "RevisionGUID": "be8e75d6-e9c2-4a55-b997-7472230407e0", "CreationDate": "2011-12-13T17:23:22.590", "UserId": 163, "Text": "We're still in the stage of trying to build the site up until it reaches critical mass. To attract users we need more content, and more frequent updates.\r\n\r\nIt's perfectly [ok to post questions you already know the answer to](http://meta.stackoverflow.com/questions/2706/posting-and-answering-questions-you-have-already-found-the-answer-to). You can even [answer your own question](http://meta.stackoverflow.com/questions/12513/should-i-not-answer-my-own-questions), or you can try to stump the other users. Just be sure you're phrasing your questions as if you're really asking about a problem you're having, and phrase your answers as if you're answering someone else's question.\r\n\r\nAsking tricky questions will attract more experts. It's also good to ask common questions and give good thorough answers, which will attract new users via search engines. Finally, help flesh out the scope of the site by asking about topics which haven't been brought up at all yet if you can think of any."}
{"Id": 197, "PostHistoryTypeId": 1, "PostId": 102, "RevisionGUID": "be8e75d6-e9c2-4a55-b997-7472230407e0", "CreationDate": "2011-12-13T17:23:22.590", "UserId": 163, "Text": "Ask questions, even if you know the answers"}
{"Id": 198, "PostHistoryTypeId": 3, "PostId": 102, "RevisionGUID": "be8e75d6-e9c2-4a55-b997-7472230407e0", "CreationDate": "2011-12-13T17:23:22.590", "UserId": 163, "Text": "<discussion><asking-questions>"}
{"Id": 199, "PostHistoryTypeId": 2, "PostId": 103, "RevisionGUID": "d8108c1a-0f28-4e4d-b92c-fe87742fb919", "CreationDate": "2011-12-14T21:36:20.297", "UserId": 78, "Text": "In my home state of NJ, air guns are classified as firearms, and unlawful possession carries the same penalties.\r\n\r\nSo if someone asks in here about air-powered guns, is it on-topic?"}
{"Id": 200, "PostHistoryTypeId": 1, "PostId": 103, "RevisionGUID": "d8108c1a-0f28-4e4d-b92c-fe87742fb919", "CreationDate": "2011-12-14T21:36:20.297", "UserId": 78, "Text": "Are air rifles/pistols firearms?"}
{"Id": 201, "PostHistoryTypeId": 3, "PostId": 103, "RevisionGUID": "d8108c1a-0f28-4e4d-b92c-fe87742fb919", "CreationDate": "2011-12-14T21:36:20.297", "UserId": 78, "Text": "<discussion>"}
{"Id": 202, "PostHistoryTypeId": 2, "PostId": 104, "RevisionGUID": "7060983f-1f04-46fe-9132-1f29ee258b5d", "CreationDate": "2011-12-14T22:31:37.450", "UserId": 166, "Text": "dgm - I weighed in with my $0.02 in another topic here that asked about the definition of \"firearms\" as it pertains to the SE.\r\nhttp://meta.firearms.stackexchange.com/questions/1/how-do-we-define-firearms\r\n\r\n> To clear up any misunderstandings and to keep the topics consistent, I suggest that the exchange adopt the existing definitions of firearms that are already codified in the USC. While some states and political subdivisions may further define other items like pellet guns, airsoft, slingshots, etc as weapons, it is too local to be consistent with Q&A. As an example, one state in mind has criminal statutes and environmental statutes that conflict with respect to defining what is a “pistol.”\r\n\r\n>  With a consistent definition of firearms (Title I and Title II), the exchange will avoid the circumstances of providing legal advice as discussed in a previous question in this meta. Having the exchange define “firearms” in too broad a sense will result in diluting the content shared. Generally speaking, many people do not consider other devices firearms unless they propel a projectile by way of an explosive propellant, no matter how a few states may define other projectile weapons.\r\n\r\nIn other words, discussions pertaining to airsoft and the like should be considered O/T, with a caveat...  Plenty of folks use airsoft and other non-lethal firearm facsimiles as training aids to augment their skills with lethal firearms.  Use of these non-lethal items in a training context should be allowed.  \r\n\r\n\r\n  \r\n\r\n\r\n"}
{"Id": 203, "PostHistoryTypeId": 2, "PostId": 105, "RevisionGUID": "2e3ee55d-ae2d-4c62-ad6e-90c03255e7da", "CreationDate": "2011-12-15T16:21:49.147", "UserId": 288, "Text": "I think whether air guns are firearms and whether questions about air guns are on topic is really two different issues.  I personally don't consider them to be firearms, but I'm not opposed to considering air guns on topic as long as they are properly tagged.\r\n\r\nThe reason I think they are a good fit for the site is that there is a large overlap in the community and so many of the principles are the same between the subjects.  Even if we don't shoot them much anymore, a lot of us started out on air guns and still have them around for our children to start out on and/or for dealing with pest animals in areas where discharging a firearm is illegal or inadvisable.  There's even a niche of people who use air guns for hunting.  I propose allowing air gun questions at least for a while during the beta and seeing if the questions seem too far out of place.\r\n\r\nFor example, I have been wondering why BBs and pellets aim differently out of the same air rifle, and how to compensate for it.  In my opinion, questions like that don't detract from the expert or serious enthusiast feel of the site."}
{"Id": 204, "PostHistoryTypeId": 2, "PostId": 106, "RevisionGUID": "0aee4695-ff58-488b-adb9-070d80c3f996", "CreationDate": "2011-12-16T05:26:01.143", "UserId": 163, "Text": "Do we want to have tags for specific models of firearms? I think having manufacturer tags like [tag:remington] and [tag:mossberg] makes sense, and tags like [tag:1911] and [tag:ar-15] makes sense to me because they describe whole families of weapons.\r\n\r\nHowever, tags like [tag:taurus-pt92] and [tag:beretta-92] seem to be getting overly specific. I think tagging with a combination of manufacturer, class ([tag:rifle]/[tag:pistol]/[tag:shotgun]) and possibly caliber will provide better links under Related Questions.\r\n\r\n"}
{"Id": 205, "PostHistoryTypeId": 1, "PostId": 106, "RevisionGUID": "0aee4695-ff58-488b-adb9-070d80c3f996", "CreationDate": "2011-12-16T05:26:01.143", "UserId": 163, "Text": "Tags for specific models of firearms"}
{"Id": 206, "PostHistoryTypeId": 3, "PostId": 106, "RevisionGUID": "0aee4695-ff58-488b-adb9-070d80c3f996", "CreationDate": "2011-12-16T05:26:01.143", "UserId": 163, "Text": "<discussion><tags><specificity>"}
{"Id": 207, "PostHistoryTypeId": 2, "PostId": 107, "RevisionGUID": "62f56692-7953-44df-b460-df0c82736d02", "CreationDate": "2011-12-16T15:33:11.483", "UserId": 78, "Text": "I think the model-specific tags could easily get out of hand. How many hundreds of different firearms models are out there? Even within a single mfr like Sig-Sauer, for a single pattern like the P-229, there are ten sub-models.\r\n\r\nI vote NO for model-specific tags."}
{"Id": 208, "PostHistoryTypeId": 2, "PostId": 108, "RevisionGUID": "17653164-1953-48b4-89f6-bcaa5c39c1e4", "CreationDate": "2011-12-16T19:23:43.253", "UserId": 111, "Text": "Agreed. We can revise the policy later if we start seeing a lot of questions on a specific model, but for now, I also vote no.\r\n"}
{"Id": 209, "PostHistoryTypeId": 2, "PostId": 109, "RevisionGUID": "a4ebcba1-73bb-494e-ad67-5d325e8d164b", "CreationDate": "2011-12-29T02:38:21.077", "UserId": 78, "Text": "A recent question is actually asking several questions all at once.\r\n\r\nhttp://firearms.stackexchange.com/questions/892/25-naa-and-32-naa-caliber\r\n\r\nShould we request that the poster ask the questions all separately, or is a composite question ok?"}
{"Id": 210, "PostHistoryTypeId": 1, "PostId": 109, "RevisionGUID": "a4ebcba1-73bb-494e-ad67-5d325e8d164b", "CreationDate": "2011-12-29T02:38:21.077", "UserId": 78, "Text": "What should we do with questions that are really multiple questions in one?"}
{"Id": 211, "PostHistoryTypeId": 3, "PostId": 109, "RevisionGUID": "a4ebcba1-73bb-494e-ad67-5d325e8d164b", "CreationDate": "2011-12-29T02:38:21.077", "UserId": 78, "Text": "<discussion>"}
{"Id": 212, "PostHistoryTypeId": 2, "PostId": 110, "RevisionGUID": "d6a7c7ba-5015-4c42-a34c-21efb75e5223", "CreationDate": "2011-12-29T03:49:28.830", "UserId": 37, "Text": "Eeek. At first my answer was going to be \"of course we split them up!\". The problem with that specific question is that those cartridges may be really related in that they may be hard-to-find and each designed for a a single specific gun from a single manufacturer. I don't know if this is true, too lazy to look it up right now, but I suspect it is.\r\n\r\nWhat's the analogous question from other SE sites like StackOverflow, ServerFault, or SuperUser?"}
{"Id": 214, "PostHistoryTypeId": 2, "PostId": 111, "RevisionGUID": "3d1436aa-1918-45c5-80cb-d56ed7cb0269", "CreationDate": "2012-02-06T20:35:49.927", "UserId": 380, "Text": "Best case, active community members repost the separate questions with the accompanied answers (which means the initial post has been completely settled), link it to the main topic, and then get the moderators to close the topic.\r\n\r\nThink about how the site works to begin with, as you post your question it mines your post as you type and compares it to the existing body of posts. That multi-part question and answer will be a lot more difficult for some new poster to negotiate as a duplicate as opposed to a single question with a single well defined, and well ranked answer."}
{"Id": 215, "PostHistoryTypeId": 2, "PostId": 112, "RevisionGUID": "75295701-9c40-4b15-8f74-baba4bc24fa4", "CreationDate": "2012-02-06T20:39:31.297", "UserId": 380, "Text": "Yes, as it expands the knowledge base and makes us more relevant to search engines. The stackexchange sites are faster than most message boards, google's pagerank takes page response time into account to the value of the link. The slower the load, the less it's worth.\r\n\r\nSo if we start posting questions and then answering them, which are then vetted in the community. Those high quality posts served by this fast site will come up more often in search engines, which will drive more traffic to the site and thus increase our community. It's a circle of happiness :-)"}
{"Id": 216, "PostHistoryTypeId": 2, "PostId": 113, "RevisionGUID": "ac8299e8-f2d2-4900-aa71-30a9b4214b94", "CreationDate": "2012-02-17T15:40:08.553", "UserId": 163, "Text": "I think plural tags are more natural actually. Tags describe *groups* of questions, not just individual questions. You wouldn't say that the questions are about \"shotgun\", you'd say they're about \"shotguns\"."}
{"Id": 217, "PostHistoryTypeId": 2, "PostId": 114, "RevisionGUID": "f5eb0fa3-99e4-4e5b-8722-529412da15de", "CreationDate": "2012-02-27T13:33:44.730", "UserId": 317, "Text": "Pneumatic weapons have a lot in common in operation with firearms. Are they on-topic here or is this site strictly restricted to gunpowder-operated weapons?"}
{"Id": 218, "PostHistoryTypeId": 1, "PostId": 114, "RevisionGUID": "f5eb0fa3-99e4-4e5b-8722-529412da15de", "CreationDate": "2012-02-27T13:33:44.730", "UserId": 317, "Text": "Are pneumatic weapons on-topic?"}
{"Id": 219, "PostHistoryTypeId": 3, "PostId": 114, "RevisionGUID": "f5eb0fa3-99e4-4e5b-8722-529412da15de", "CreationDate": "2012-02-27T13:33:44.730", "UserId": 317, "Text": "<support><scope>"}
{"Id": 220, "PostHistoryTypeId": 5, "PostId": 114, "RevisionGUID": "e58c0892-433d-42d3-bc68-680861dbc3b4", "CreationDate": "2012-02-27T18:47:35.923", "UserId": -1, "Comment": "insert duplicate link", "Text": "> **Possible Duplicate:**  \n> [How do we define &#39;Firearms&#39;?](http://meta.firearms.stackexchange.com/questions/1/how-do-we-define-firearms)  \n\n<!-- End of automatically inserted text -->\n\nPneumatic weapons have a lot in common in operation with firearms. Are they on-topic here or is this site strictly restricted to gunpowder-operated weapons?"}
{"Id": 221, "PostHistoryTypeId": 10, "PostId": 114, "RevisionGUID": "2f813c20-c5d4-4e01-b24a-5198cd1f0537", "CreationDate": "2012-02-27T18:47:34.053", "UserId": 111, "CloseReasonId": 1, "Text": "[{\"Id\":111,\"DisplayName\":\"OldWolf\"}]"}
{"Id": 222, "PostHistoryTypeId": 2, "PostId": 115, "RevisionGUID": "c74a0513-e94f-4807-bd38-235211fd303b", "CreationDate": "2012-03-02T02:13:06.777", "UserId": 163, "Text": "The latest blog mentions \"Greatest Hits\"--the questions most frequently bringing in visitors from search engines. Maybe checking out [our greatest hits](http://firearms.stackexchange.com/questions/greatest-hits) will inspire some more good questions.\r\n\r\nAlso, our [site stats](http://area51.stackexchange.com/proposals/164/firearms) aren't so good, so ask more questions and invite your friends:\r\n\r\n - 1500 visits per day is good, 500 or less needs work. We're at 349.\r\n - 15 questions per day is a healthy site, 5 or less needs work. We're at **1.4**.\r\n"}
{"Id": 223, "PostHistoryTypeId": 1, "PostId": 115, "RevisionGUID": "c74a0513-e94f-4807-bd38-235211fd303b", "CreationDate": "2012-03-02T02:13:06.777", "UserId": 163, "Text": "Our greatest hits"}
{"Id": 224, "PostHistoryTypeId": 3, "PostId": 115, "RevisionGUID": "c74a0513-e94f-4807-bd38-235211fd303b", "CreationDate": "2012-03-02T02:13:06.777", "UserId": 163, "Text": "<discussion><content-quality>"}
{"Id": 225, "PostHistoryTypeId": 2, "PostId": 116, "RevisionGUID": "b5cc7d6c-976c-4464-aa20-7ab48d78c340", "CreationDate": "2012-03-02T21:20:13.700", "UserId": 111, "Text": "That's a good point bemace and there are good ideas in Ubuntu's post. Maybe we can also get some of the original posters to rephrase some of the answered questions like.\r\n\"Differences between AR-15 Carbine vs Mid-Length Gas Systems\" to cover the broader material that the answer covered. I think Bryson's answer to that post in particular covered all 3 primary gas length systems."}
{"Id": 226, "PostHistoryTypeId": 2, "PostId": 117, "RevisionGUID": "f3f39924-56ab-417c-aa42-4d58f5cc1fce", "CreationDate": "2012-03-24T02:19:07.170", "UserId": 6, "Text": "Your site looks a bit different today. Yes, we are getting rid of the 'Sketchy' look and replacing it with a more-polished and finished design for sites in beta.\r\n\r\nYou can read more about the redesign of our Beta theme on our [blog entry][1].\r\n\r\nPlease note: This will not affect your \"graduation\" status in any way. When your site is due for graduation, it will get its final(real) site design and branding.\r\n\r\nIf you're still seeing the old favicon, please do a hard browser refresh. (Although sometimes it may take Chrome a while to load the new image).\r\n\r\nIf you see any CSS or styling issues, please report it **[in this post][2]** I created on Meta Stack Overflow. It will be easier for me to track all the bug reports there.\r\n\r\n\r\n  [1]: http://blog.stackoverflow.com/2012/03/the-new-stack-exchange-beta-theme-2/\r\n  [2]: http://meta.stackoverflow.com/questions/126185/new-stack-exchange-beta-theme"}
{"Id": 227, "PostHistoryTypeId": 1, "PostId": 117, "RevisionGUID": "f3f39924-56ab-417c-aa42-4d58f5cc1fce", "CreationDate": "2012-03-24T02:19:07.170", "UserId": 6, "Text": "New Beta Theme Launched"}
{"Id": 228, "PostHistoryTypeId": 3, "PostId": 117, "RevisionGUID": "f3f39924-56ab-417c-aa42-4d58f5cc1fce", "CreationDate": "2012-03-24T02:19:07.170", "UserId": 6, "Text": "<discussion><featured><design>"}
{"Id": 229, "PostHistoryTypeId": 25, "PostId": 117, "RevisionGUID": "fd1e106a-ee71-472f-ba70-e87041ceae06", "CreationDate": "2012-03-24T08:37:59.923", "Comment": "http://twitter.com/#!/StackFirearms/status/183472719847899136"}
{"Id": 230, "PostHistoryTypeId": 2, "PostId": 118, "RevisionGUID": "5636c801-9c6c-47aa-b0d3-b62848632c21", "CreationDate": "2012-04-25T16:47:39.387", "UserId": 48, "Text": "As mentioned in [the recent blog post](http://blog.stackoverflow.com/2012/04/when-a-site-grows-quiet/), I must reluctantly announce that we'll be shutting this site down on Friday, May 4th, 2012. While a fine topic, progress here has been slow for some time now, and it simply does not appear that this topic has a strong enough following on our network to support the site long-term:\r\n\r\n> But when a site struggles to maintain any semblance of steady progress — when it's struggling to garner an audience, a healthy core of experts, and a steady stream of questions — it becomes increasingly unlikely that the site will find a core audience to sustain it.\r\n\r\nSo rather than stringing you along with hope of eventual graduation, I'd like to thank you all for the time and effort you've put in here, and encorage you to continue persuing your interest in the subject - either elsewhere on Stack Exchange, or elsewhere on The Internet.\r\n\r\nAs the SE audience continues to grow, it may well be that a site dedicated to firearms will yet see the light of day, whether as part of a larger site, or reborn on [Area 51](http://area51.stackexchange.com/).\r\n\r\nIn the meantime, the questions and answers posted here will be made available for [download and re-use](http://blog.stackoverflow.com/2011/09/creative-commons-data-dump-sep-11/)  by anyone who wants them.\r\n\r\nFinally, if you see a question here that would make a good addition to a different site, please flag it for moderator attention in the next few days and suggest that it be migrated."}
{"Id": 231, "PostHistoryTypeId": 1, "PostId": 118, "RevisionGUID": "5636c801-9c6c-47aa-b0d3-b62848632c21", "CreationDate": "2012-04-25T16:47:39.387", "UserId": 48, "Text": "Firearms is closing"}
{"Id": 232, "PostHistoryTypeId": 3, "PostId": 118, "RevisionGUID": "5636c801-9c6c-47aa-b0d3-b62848632c21", "CreationDate": "2012-04-25T16:47:39.387", "UserId": 48, "Text": "<discussion><featured>"}
{"Id": 233, "PostHistoryTypeId": 5, "PostId": 118, "RevisionGUID": "22d0239b-28ef-440c-88d9-93547edcdc68", "CreationDate": "2012-04-25T16:53:15.327", "UserId": 48, "Comment": "added 1 characters in body", "Text": "As mentioned in [the recent blog post](http://blog.stackoverflow.com/2012/04/when-a-site-grows-quiet/), I must reluctantly announce that we'll be shutting this site down on Friday, May 4th, 2012. While a fine topic, progress here has been slow for some time now, and it simply does not appear that this topic has a strong enough following on our network to support the site long-term:\r\n\r\n> But when a site struggles to maintain any semblance of steady progress — when it's struggling to garner an audience, a healthy core of experts, and a steady stream of questions — it becomes increasingly unlikely that the site will find a core audience to sustain it.\r\n\r\nSo rather than stringing you along with hope of eventual graduation, I'd like to thank you all for the time and effort you've put in here, and encourage you to continue pursuing your interest in the subject - either elsewhere on Stack Exchange, or elsewhere on The Internet.\r\n\r\nAs the SE audience continues to grow, it may well be that a site dedicated to firearms will yet see the light of day, whether as part of a larger site, or reborn on [Area 51](http://area51.stackexchange.com/).\r\n\r\nIn the meantime, the questions and answers posted here will be made available for [download and re-use](http://blog.stackoverflow.com/2011/09/creative-commons-data-dump-sep-11/)  by anyone who wants them.\r\n\r\nFinally, if you see a question here that would make a good addition to a different site, please flag it for moderator attention in the next few days and suggest that it be migrated."}
{"Id": 234, "PostHistoryTypeId": 25, "PostId": 118, "RevisionGUID": "5130b597-9ffb-4f0b-86f1-ddf23b95f164", "CreationDate": "2012-04-25T17:11:08.140", "Comment": "http://twitter.com/#!/StackFirearms/status/195198262750347264"}
{"Id": 235, "PostHistoryTypeId": 2, "PostId": 119, "RevisionGUID": "6e316777-9b6b-411d-86f1-2063adbb062e", "CreationDate": "2012-05-01T13:17:16.537", "UserId": 143, "Text": "I think it's tragic that \r\n\r\n - the community did not step up when this was announced and show that the firearms.SE should remain around, and\r\n - that not all beta sites that fit the model of few questions over an extended period are not getting the identical treatment"}
